{
    "entries": [
        {
            "Name": "Artisan",
            "Description": "All items need to have a creator. Artisans create, improve and repair objects, and have learned a number of skills to help them with this process.",
            "Martial Archetype": {
                "Name": "Craftsmen",
                "Skill Modifier Bonuses": "You gain a +1 increase to 3 of the following skills: <b>Athletics</b>, <b>Constitution</b>, <b>Endurance</b>, <b>Reflex</b>, <b>Investigation</b>, <b>Insight</b>, <b>Perception</b>, <b>Deception</b>, <b>Intimidation</b>, <b>Performance</b>.",
                "Tool Modifier Bonuses": "You gain a +3 modifier to one of the tool kits. You gain a +2 modifier to two other tool kits, and a +1 modifier to 3 others. You cannot choose the same tool kit to gain multiple modifiers from Craftsmen.",
                "Weapon Modifier Bonuses": "You gain a +2 modifier increase to <b>Hammers and Picks</b>, as well as another +2 modifier to another weapon group.",
                "Armor Training": "You are trained with <b>Light</b>, <b>Medium</b> and <b>Heavy</b> armor.",
                "Shield Training": "You are trained with <b>Shields</b>.",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Features": [
                    {
                        "Name": "Crafting",
                        "Description": [
                            "Starting at the 1st level, assuming you have access to the required tools and access to any needed environments, such as a forge, you are able to craft 5 gp * your Craftsmen level worth of a mundane object (that is not a +1 weapon or +1 armor) per day. If you finish crafting an object on a day but have spare gp left of your daily allotance, you can begin construction on another mundane item.",
                            "You do not need to specifically have the raw materials on hand. If you don’t have already, you just need the gold and a means to buy said materials.",
                            "For example, should a level 3 Craftsmen wish to make a War Spear, it would take 2 days of crafting - the first day to do 15 gp worth of construction, followed by 10 gp the next day."
                        ]
                    },
                    {
                        "Name": "Battle Smith",
                        "Description": [
                            "At the second level, your skills with crafting have made you very precise. When you take the attack action, you are able to directly target the your opponent’s armor in a direct attempt to damage it. If your weapon attack hits your target, you are able to forgo all damage your attack would do in favor of damaging the armor. A Damaged piece of armor has a -2 to the AC until it is repaired by <b>Leatherworker’s</b>, <b>Tinkers’</b> or <b>Smith’s Tools</b>.",
                            "The creature must be wearing armor for this ability to work. If the opponent is wearing <b>Padded</b>, <b>Leather</b> or any other armor with less than 2 AC bonus, their AC bonus from armor is reduced to 0."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Artisan of All Trades",
                        "Description": [
                            "At the fourth level, the basics of tool sets that come your way, allowing you to increase your proficiency with them more easily. You increase tool modifiers (not skills nor weapons) on a roll of natural 19 in addition to natural 20s."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Improved Crafting",
                        "Description": [
                            "At the sixth level, when you have access to a forge, you are able to craft mundane +1 weapons and armor. These items cost 2x their gp time price, but only their standard amount of gold of raw materials are needed to make them. In addition, a Craftsmen can turn a standard weapon or armor into its mundane +1 variant for no additional raw material, but half of the gold time.",
                            "For example, a level 6 Craftsmen wishing to craft a +1 War Spear from scratch would need to spend 2 days crafting - 30 gp of time spent on the first day, and another 20 on the second. However, only 25 gp of raw material would be needed to craft this spear (the character would only lose 25 gp of gold).",
                            "This same level 6 Craftsmen, if they should wish to turn a standard War Spear into a mundane +1 War Spear would only take 25 gp of crafting time on one day to complete the enhancements, with no extra raw material being needed."
                        ]
                    },
                    {
                        "Name": "Flash of Genius",
                        "Description": [
                            "Starting at seventh level, you gain the ability to come up with solutions under pressure. When you or another creature you can see within 30 feet of you makes an skill check, they your Craftsmen level to the roll.",
                            "You can use this feature a number of times equal to your Craftsmen level. You regain all expended uses when you finish a rest."
                        ]
                    },
                    {
                        "Name": "Improved Artisan of All Trades",
                        "Description": [
                            "At the eighth level, your knowledge of tools has become more refined. You increase tool modifiers (not skill nor weapon modifiers) on ar oll of a natural 18, 19 or 20."
                        ]
                    },
                    {
                        "Name": "Tool Expertise",
                        "Description": [
                            "At the ninth level, your skills with one tool become insurmountable. Choose one of the tool sets.",
                            "For the chosen tool, any roll below an 11 (before modifiers are appled) is treated as an 11 (before modifiers). Additionally, any passive checks that happen to use this tool become as if you rolled a natural 11, and are now calculated as 11 + your tool modifier + your skill modifier (if applicable) + other modifiers."
                        ]
                    },
                    {
                        "Name": "Improved Battle Smith",
                        "Description": [
                            "At the tenth level, when you attack a creature with damaged armor, in lieu dealing damage, you are able to expand upon the damage dealt. The armor become Shattered, giving it the creature a -5 AC bonus until repaired. This armor takes two repairs in order to be fixed - the first makes the armor Damaged (-2 AC bonus), and the second returns it to normal.",
                            "The creature must be wearing armor for this ability to work. If the opponent is wearing an armor with less than 5 AC bonus, their AC bonus from armor is reduced to 0."
                        ]
                    },
                    {
                        "Name": "Masterwork",
                        "Description": [
                            "At the eleventh level, you have finished your masterpiece. Confer with your LM to determine exactly what this item is - it could be a new or powerful weapon or armor (such as a gun, a “grenade” launcher using alchemical supplies, a +3 weapon or a +3 armor), a machine, or any other non-magical object in the world. With your LM’s permission, you could also invent a magical object with the help of a magic user.",
                            "Subtract whatever raw materials from your total gold equivalent to the gold cost of your item. You now have your masterpiece."
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Artificier",
                "Skill Modifier Bonuses": "You gain a +1 increase to 3 of the following skills: <b>Arcana</b>, <b>Reflex</b>, <b>Investigation</b>, <b>Insight</b>, <b>Perception</b>, <b>Deception</b>, <b>Intimidation</b>, <b>Performance</b>.",
                "Tool Modifier Bonuses": "You gain a +3 modifier to one of the tool kits. You gain a +2 modifier to two other tool kits, and a +1 modifier to 3 others. You cannot choose the same tool kit to gain multiple modifiers from Artificier.",
                "Weapon Modifier Bonuses": "You gain a +1 modifier increase to <b>Hammers and Picks</b>",
                "Spellcasting Modifier Bonuses": "You gain a +2 modifier increase to <b>Transmutation Magic</b>, and an additional +1 modifier to 2 other schools of magic",
                "Armor Training": "You are trained with <b>Light</b> and <b>Medium</b> armor.",
                "Shield Training": "You are trained with <b>Shields</b>.",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Primary Spellcasting Skill": "<b>Arcana</b>",
                "Number of Spells Known": [
                    "At the first level, you know 4 + your <b>Arcana</b> Modifier spells.",
                    "Upon a level up, you learn 1 spell. Whenever your <b>Arcana</b> Modifier increases, you learn an additional spell."
                ],
                "Features": [
                    {
                        "Name": "Magical Tinkering",
                        "Description": [
                            "At first level, you learn how to invest a spark of magic into mundane objects. You touch a Tiny nonmagical object as an action and give it one of the following magical properties of your choice:",
                            "<ul><li>The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet.</li><li>Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. You utter the message when you bestow this property on the object, and the recording can be no more than 6 seconds long.</li><li>The object continuously emits your choice of an odor or a nonverbal sound (wind, waves, chirping, or the like). The chosen phenomenon is perceivable up to 10 feet away.</li><li>A static visual effect appears on one of the object’s surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements, as you like.</li></ul>",
                            "The chosen property lasts indefinitely. As an action, you can touch the object and end the property early.",
                            "You can bestow magic on multiple objects, touching one object each time you use this feature, though a single object can only bear one property at a time. The maximum number of objects you can affect with this feature at one time is equal to the number of levels in Artificier. If you try to exceed your maximum, the oldest property immediately ends, and then the new property applies."
                        ]
                    },
                    {
                        "Name": "Magic Item Crafting",
                        "Description": [
                            "Starting at the second level, you are able to imbue 5 gp * your Artificer level’s worth of magic into an object per day. If you finish crafting an object on a day but have spare gp left of your daily allotance, you can begin construction on another mundane item.",
                            "For every 5 gp you imbue into a magic item, you expend 1 mana.",
                            "In order to imbue an object, you need to have an mundane variant of it - you are not crafting the object from scratch, rather imbuing an object with magic. The total gold cost required to make a mundane object magical can be seen in the Equipment lists.",
                            "At the second level, you can only craft Common magic items. At the fourth, you can additionally craft Uncommon. At the sixth, Rare, the eighth, Very Rare, and at the tenth level, Legendary."
                        ]
                    },
                    {
                        "Name": "Minor Alchemy",
                        "Description": [
                            "Starting at third level when you select this school, you can temporarily alter the physical properties of one nonmagical object, changing it from one substance into another. You perform a special alchemical procedure on one object composed entirely of wood, stone (but not a gemstone), iron, copper, or silver, transforming it into a different one of those materials. For each 10 minutes you spend performing the procedure, you can transform up to 1 cubic foot of material. After 1 hour, or until you lose your concentration (as if you were concentrating on a spell), the material reverts to its original substance."
                        ]
                    },
                    {
                        "Name": "Runic Glyph",
                        "Description": [
                            "At the fourth level, you learn how to imbue items with spell. You cast a spell that targets either a single creature or an area and direct it into your chosen item. If the spell is a concentration spell, the concentration is held by the item, and will run until time runs out, or the object is destroyed.",
                            "You must pass a DC 20 + the level of the spell check of the spell’s school of magic in order to successfully imbue the object. On a success, as the spell is cast, the magic carves a rune specific to that spell into the object. When a creature that is not you gets within 5 feet of the glyph, the spell triggers.",
                            "If you fail the check, you expend mana as if you had just cast the spell.",
                            "The glyph is nearly invisible and requires a successful Investigation or Arcana check against your Arcana Spell Save DC to be found."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Scrivener",
                        "Description": [
                            "At the seventh level, your knowledge of magic allows you to create spell scrolls. In order to do so, you need to use Calligrapher’s Supplies and spend an hour writing the scroll and imbuing the scroll with magic. Make a Calligrapher’s Supplies Arcana check against a DC of 20 + the level of spell that you are attempting to apply to the scroll. Upon a success, your scroll has successfully been made. Upon a failure, the scrolls burns itself as if it had just been used.",
                            "Regardless of the outcome of your check, you expend mana as if you had just cast the spell."
                        ]
                    },
                    {
                        "Name": "The Right Tool for the Job",
                        "Description": [
                            "At eighth level, you learn how to produce exactly the tool you need: with thieves’ tools or artisan’s tools in hand, you can magically create one set of artisan’s tools in an unoccupied space within 5 feet of you. This creation requires 1 hour of uninterrupted work, which can coincide with a short or long rest. Though the product of magic, the tools are nonmagical, and they vanish when you use this feature again."
                        ]
                    },
                    {
                        "Name": "Spell-Storing Item",
                        "Description": [
                            "At ninth level, you learn how to store a spell in an object. You can touch a weapon or one item that you can use as a spellcasting focus, and you store a spell in it, choosing a 1st- or 2nd-level spell from the artificer spell list that requires 1 action to cast.",
                            "While holding the object, a creature can take an action to produce the spell’s effect from it, using your spellcasting ability modifier. If the spell requires concentration, the creature must concentrate. The spell stays in the object until it has been used or dispelled.",
                            "You can imbue a number of items in this manner equal to half of your Articier level. If you imbue one item more than this limit, the item with the oldest enchantment has the spell dispelled."
                        ]
                    },
                    {
                        "Name": "Improved Magic Item Crafting",
                        "Description": [
                            "At the tenth level, you can additionally add 5 * your Arcana spellcasting modifier worth of GP to the amount you can craft on a daily basis.",
                            "Additionally, your mana usage decreases from one mana per 5 gp used, to one mana per 10 gp used."
                        ]
                    },
                    {
                        "Name": "Soul of Artifice",
                        "Description": [
                            "At the eleventh level, you develop a mystical connection to magic items you have attuned to, which you can draw on for protection. When you are reduced to 0 hit points, but not killed outright, you can use your Reaction to end the attunement to one of your items, causing you to drop to 1 hit point instead of 0.",
                            "The magic imbuing the item you have lost attunement to takes the damage for you, and the item itself becomes mundane. In order to make the item magical again, it would need to go through the Magic Item Crafting process."
                        ]
                    }
                ]
            }
        },
        {
            "Name": "Actor",
            "Description": "Everyone needs happiness. An actor is a performer who not only entertains outsiders, but keeps up the spirits of their party with their personality and skills.",
            "Martial Archetype": {
                "Name": "Entertainer",
                "Skill Modifier Bonuses": "You gain a +2 increase to any 3 skill modifiers. You gain an additionaly +1 modifier to any 3 other skills. You cannot choose any skill more than once.",
                "Tool Modifier Bonuses": "You gain a +1 modifier increase to 3 of the following tool kits: <b>Alchemist’s Supplies</b>, <b>Brewer’s Supplies</b>, <b>Calligrapher’s Supplies</b>, <b>Carpenter’s Tools</b>, <b>Cartographer’s Tools</b>, <b>Disguise Kit</b>, <b>Leatherworker’s Tools</b>, <b>Mason’s Tools</b>, <b>Painter’s Supplies</b>, <b>Tinker’s Tools</b>, <b>Weaver’s Tools</b>, <b>Woodcarver’s Tools</b>.",
                "Weapon Modifier Bonuses": "You gain a +2 modifier increase to 2 of the following weapon groups: <b>Ambush Weapons</b>, <b>Bows and Slings</b>, <b>Combat Blades</b>, <b>Dueling Blades</b>, <b>Spears</b>, <b>Throwing Weapons</b>, <b>Natural Weapons</b>.",
                "Armor Training": "You are trained with <b>Light</b> and <b>Medium</b> armor.",
                "Shield Training": "You are trained with <b>Shields</b>.",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment.",
                "Features": [
                    {
                        "Name": "Inspiration",
                        "Description": [
                            "At the first level, you are able to inspire your allies with your theatrics. You have a number of Inspiration Die (d4) equal to your levels in Entertainer. Once per round, you are able to give this inspiration to your allies, allowing them to an extra d4 on any attack, skill check or saving throw.",
                            "You can give this inspiration after the role has been made, but before you know the outcome. The player must immediately use this Inspiration Die. You regain all spent Inspiration Die upon completion of a rest."
                        ]
                    },
                    {
                        "Name": "Entertainer’s Delight",
                        "Description": [
                            "Starting at the second level, during a rest, you are able to entertain your allies, allowing all (including yourself) to regain extra hit points equal to your number of levels in Entertainer."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Jack of All Trades",
                        "Description": [
                            "At the fourth level, as an entertainer, you tend to be good at just about anything that comes your way. If you aren’t good at it, you learn it. You increase skill modifiers (not tool nor weapon modifiers) on a roll of a natural 19, in addition to rolls of a natural 20."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Improved Inspiration",
                        "Description": [
                            "At the sixth level, your Inspiration Die given by your first level Inspiration ability are d6 rather than d4s.",
                            "Additionally, whoever gains your Inspiration Die no longer have to immediately spend them. They can be held and spent later in the day. A character can only hold one Inspiration Die - they can be given a second, but must immediately use it on the triggering roll."
                        ]
                    },
                    {
                        "Name": "Combat Inspiration",
                        "Description": [
                            "At the seventh level, when a player uses an Inspiration as part of an attack, the d6 rolled is applied to both the attack roll and the damage dealt."
                        ]
                    },
                    {
                        "Name": "Improved Entertainer’s Delight",
                        "Description": [
                            "At the eighth level, your entertainment during rests reaches new heights. Yourself and allies are cured of the Frightened condition if afflicted. Additionally, if any of the hit points gained from this ability would not be applied due to a character hitting their hit points maximum, the extra hit points become temporary hit points that are lost upon the next rest."
                        ]
                    },
                    {
                        "Name": "Expertise",
                        "Description": [
                            "At the ninth level, your skills with one ability become quite honed. Choose one of the following skills:",
                            "<b>Acrobatics</b>, <b>Tradition</b> (one specific tradition skill), <b>Insight</b>, <b>Deception</b>, <b>Intimidation</b>, <b>Performance</b>, <b>Persuasion</b>",
                            "For the chosen skills, any roll below a 11 (before modifiers are applied) is treated as a 11 (before modifiers). Additionally, your passive checks for this skill become as if you rolled a natural 11, and are now calculated as 11 + primary ability modifier + skill modifier + other modifiers"
                        ]
                    },
                    {
                        "Name": "Improved Jack of All Trades",
                        "Description": [
                            "At the tenth level, your way of learning has become more refined. You increase skill modifiers (not tool nor weapon modifiers) on a roll of a natural 18, 19 or 20.s"
                        ]
                    },
                    {
                        "Name": "Flourish",
                        "Description": [
                            "At the eleventh level, your skill with your weapon reflects your acting prowess. You are able to embed your own style into your fighting. Your movement speed increases by 10 ft. Once per turn, you can expend one of your Inspiration Die choose one of the following flourishes to embed as part of your action:"
                        ],
                        "Options": [
                            {
                                "Name": "Aggressive Flourish",
                                "Description": [
                                    "You gain a bonus to your weapon attack equal to your level in Entertainer for your next attack. If you score a critical hit, the target is stunned until the start of your next turn."
                                ]
                            },
                            {
                                "Name": "Defensive Flourish",
                                "Description": [
                                    "Your weapon gains the deflect trait (even if it is a ranged weapon). If your weapon already has the deflect trait, you can deflect an additional damage equal to your level in Entertainer.",
                                    "If you reduce the damage to 0 and your opponent is wielding a disarmable melee weapon, you disarm your opponent, and their blade falls into your hand (assuming you have a free hand). Otherwise, it falls to the ground."
                                ]
                            },
                            {
                                "Name": "Mobile Flourish",
                                "Description": [
                                    "You gain a spring in your step. You gain extra movement speed as if you had taken the dash action. For every 10 feet you move in a straight line before attacking an opponent this turn, you gain an extra 1d6 weapon damage."
                                ]
                            }
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Bard",
                "Skill Modifier Bonuses": "You gain a +2 increase <b>Performance to any other 2 skill modifiers. You gain an additionally +1 modifier to any 3 other skills. You cannot choose any skill more than once.",
                "Tool Modifier Bonuses": "You gain a +1 modifier increase to 3 of the following tool kits: <b>Alchemist’s Supplies</b>, <b>Brewer’s Supplies</b>, <b>Calligrapher’s Supplies</b>, <b>Carpenter’s Tools</b>, <b>Cartographer’s Tools</b>, <b>Disguise Kit</b>, <b>Leatherworker’s Tools</b>, <b>Mason’s Tools</b>, <b>Painter’s Supplies</b>, <b>Tinker’s Tools</b>, <b>Weaver’s Tools</b>, <b>Woodcarver’s Tools</b>.",
                "Weapon Modifier Bonuses": "You gain a +1 modifier increase to 1 of the following weapon groups: <b>Ambush Weapons</b>, <b>Bows and Slings</b>, <b>Combat Blades</b>, <b>Dueling Blades</b>, <b>Spears</b>, <b>Throwing Weapons</b>, <b>Natural Weapons</b>",
                "Spellcasting Modifier Bonuses": "You gain a +2 modifier increase to <b>Abjuration Magic</b>, and an additional +1 modifier to 2 other schools of magic.",
                "Armor Training": "You are trained with <b>Light</b> Armor",
                "Shield Training": "You are not trained with <b>Shields</b>",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Primary Spellcasting Skill": "<b>Performance</b>",
                "Number of Spells Known": [
                    "At the first level, you know 4 + your <b>Performance Modifier</b> spells.",
                    "Upon a level up, you learn 1 spell. Whenever your <b>Performance</b> Modifier increases, you learn an additional spell."
                ],
                "Features": [
                    {
                        "Name": "Stagecraft",
                        "Description": [
                            "At the first level, you learn a basic spell all Bards know. You create one of the following effects within 10 feet:",
                            "<ul><li>You summon one harmless tiny beast, such as a dove or rabbit. The creature acts normally. It disappears when it is killed, when you dismiss it (no action required), when you use this ability again, or after one minute.</li><li>You change the color and style of one mundane article of clothing you are wearing.</li><li>You exhale harmless smoke or vapor in any shape no more than half a foot (15cm) on a side.</li><li>You touch your face to instantly clean it and restore your makeup. The makeup cannot conceal your identity, and is obviously illusory if inspected very closely. It may otherwise be as outlandish or as simple as you choose. Your hair is also cleaned and resheveled.</li><li>You touch a musical instrument and cause it to play a rhythmic accompaniment. The rhythm it plays must repeat every six seconds. As a bonus action, you can change the rhythm or have it play a quick flourish, after which it returns to its earlier rhythm. The instrument stops playing if you use this ability again, if you end this effect (no action required), or after 10 minutes.</li><li>You amplify your voice or the voice of a willing creature you touch up to three times its regular volume. This effect lasts up to one minute with concentration.</li></ul>",
                            "You can have only 3 effects lasting longer than one action occurring at once. If you already have 3 effects lasting longer than one action running and attempt to cast a fourth, the first effect is dismissed. You can dismiss any ongoing effect as an action."
                        ]
                    },
                    {
                        "Name": "Magical Performance",
                        "Description": [
                            "At the second level, you are able to refresh your allies with your magical music. A number of times equal to your Bard level, you can perform a one minute tune, and all allies (yourself included) that can hear you gain temporary hitpoints equal to your Performance modifier."
                        ]
                    },
                    {
                        "Name": "Unsettling Words",
                        "Description": [
                            "At the third level, you can spin music laced with magic that unsettle a creature and cause it to doubt itself. As an Ability Action, you can expend one use of your Magical Performance and choose one creature you can see within 60 feet of you. Roll the Magical Performance die. The creature must subtract the number rolled from the next Saving Throw it makes before the start of your next turn."
                        ]
                    },
                    {
                        "Name": "Combat Performance",
                        "Description": [
                            "At the fourth level, as an action, you can make a Magical Performance. All allies that can hear you gain temporary hitpoints equal to one fourth (minimum 1) as a normal Magical Performance."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Improved Magical Performance",
                        "Description": [
                            "At the sixth level, your standard Magical Performance allows allies that can hear you to gain additional temporary hitpoints equal to your Bard level."
                        ]
                    },
                    {
                        "Name": "Second School of Magic Specialization",
                        "Description": [
                            "At the seventh level, you gain access to a second of magical specialization as defined by the level 2 Magic archetype ability. You cannot choose the same specialization more than once."
                        ]
                    },
                    {
                        "Name": "Countercharm",
                        "Description": [
                            "At eighth level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. Counting as 2 usages of your Magical Performance, you can start a performance that lasts until the end of your next turn.",
                            "During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required)."
                        ]
                    },
                    {
                        "Name": "Enhanced School of Magic Specialization",
                        "Description": [
                            "At the ninth level, your knowledge of your chosen school of magic increases. You have gained new abilities related to the school of magic specialization chosen at the second level."
                        ],
                        "Options": [
                            {
                                "Name": "Abjuration",
                                "Description": [
                                    "Your studies into Abjuration magic allows you to redirect some of the magic into the spell back to yourself. Once per rest, when you cast an Abjuration spell, you can pull a strand of the magic and surround yourself with it, giving you temporary hit points equal to your Abjuration spell modifier.",
                                    "Additionally, your bonus to your Abjuration Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Conjuration",
                                "Description": [
                                    "Your studies into Conjuration magic allow you to better teleport. Once per rest, you can teleport up to 30 feet to an unoccupied space you can see.",
                                    "Additionally, your bonus to your Conjuration Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Divination",
                                "Description": [
                                    "Your ability to see beyond begins to manifest physically. You gain Darkvision with a range of 60 feet. If you already have Darkvision, the range expands by 60 feet.",
                                    "Additionally, your bonus to your Divination Spell Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Enchantment",
                                "Description": [
                                    "Your knowledge of Enchantment magic allows you to subtlely shift the direction it flows. Once per rest when you cast an Enchantment spell that targets one creature, you can make the spell target 2 creatures.",
                                    "Additionally, your bonus to your Enchantment Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Evocation",
                                "Description": [
                                    "Your experience with Evocation magic allows you to sculpt Evocation spells you cast. Once per rest, when you cast an area of effect Evocation spell, you can make a number of pockets up to or equal to your Evocation Spellcasting Modifier within the spell’s range that are not affected by the spells effects.",
                                    "Additionally, your bonus to your Evocation Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Illusion",
                                "Description": [
                                    "Your studies into Illusion magic make it your go-to solution. Once per rest when you are attacked, you can use your reaction to create an illusion of yourself just in front of yourself. The attacker will automatically hit this illusion, which dispels it.",
                                    "Additionally, your bonus to your Illusion Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Malediction",
                                "Description": [
                                    "Your understanding of Malediction magic allows you to kick your enemies while they’re down. When you attack a creature affected by one of your Malediction spells, you deal extra damage equal to your Malediction Spellcasting Modifier.",
                                    "Additionally, your bonus to your Malediction Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Necromancy",
                                "Description": [
                                    "Your studies into Necromancy magic have given you a better understanding of life forces and how to manipulate them to your benefit. Once per rest, when you kill a creature that is not an undead or a construct with a Necromancy spell, you regain hitpoints equal to your Necromancy Spellcasting Modifier (up to your hit points maximum).",
                                    "Additionally, your bonus to your Necromancy Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Transmutation",
                                "Description": [
                                    "Your studies into Transmutation magic have given you a better understanding of how magic flows. Once per rest, when you cast a Transmutation spell, you regain Mana equal to half of your Transmutation Spellcasting Bonus.",
                                    "Additionally, your bonus to your Transmutation Spellcasting Modifier increases to +2."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "Enthralling Performance",
                        "Description": [
                            "At the tenth level, once per rest, if you perform for at least 1 minute, you can attempt to inspire wonder in your audience by singing, reciting a poem, or dancing. At the end of the performance, choose a number of humanoids within 60 feet of you who watched and listened to all of it, up to a number equal to your Performance modifier. Each target must succeed on a Mental Fortitude Saving Throw against your spell save DC or be charmed by you.",
                            "While charmed in this way, the target idolizes you, it speaks glowingly of you to anyone who talks to it, and it hinders anyone who opposes you, although it avoids violence unless it was already inclined to fight on your behalf. This effect ends on a target after 1 hour, if it takes any damage, if you attack it, or if it witnesses you attacking or damaging any of its allies.",
                            "If a target succeeds on its saving throw, the target has no hint that you tried to charm it.",
                            "Using this ability counts as a usage of your Magical Performance."
                        ]
                    },
                    {
                        "Name": "Magical Secrets",
                        "Description": [
                            "At the eleventh level, your broad knowledge of magic allows you learn magic unlike others you have known. You learn 2 new spells, regardless of their level or if they are available for Bards normally."
                        ]
                    }
                ]
            }
        },
        {
            "Name": "Natural",
            "Description": "Not everyone receives formal training - some are naturally gifted. Naturals are characters that have received no formal training, but still excel at being an adventurer.",
            "Martial Archetype": {
                "Name": "Barbarian",
                "Skill Modifier Bonuses": "You gain a +1 increase to the skill modifier of 3 of the following skills. You cannot choose any skill more than once. <b>Athletics</b>, <b>Constitution</b>, <b>Endurance</b>, <b>Intimidation</b>, <b>Mental Fortitude</b>, <b>Perception</b>, <b>Reflex</b>, <b>Survival</b>",
                "Tool Modifier Bonuses": "None",
                "Weapon Modifier Bonuses": "You gain a +2 weapon bonus to 3 of the following weapon groups: <b>Axes</b>, <b>Bludgeons</b>, <b>Combat Blades</b>, <b>Dueling Blades</b>, <b>Flails and Whips</b>, <b>Hammers and Picks</b>, <b>Polearms</b>, <b>Spears</b>, <b>Throwing Weapons</b>, <b>Natural Weapons</b>",
                "Armor Training": "You are trained with <b>Light</b> and <b>Medium</b> armor",
                "Shield Training": "You are trained with <b>Shields</b>",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Features": [
                    {
                        "Name": "Battle Fury",
                        "Description": [
                            "In battle, you become deadly focused. At the first level, you can enter a battle fury as an ability action. For one minute, you have the following effects:",
                            "<ul><li>You have advantage on <b>Athletics</b>, <b>Constitution</b>, <b>Endurance</b> and <b>Mental Fortitude</b> checks and saving throws.</li>",
                            "<li>You gain a +2 damage bonus to all melee weapons (including Natural Weapons).</li>",
                            "<li>You gain resistance to all non-magical damage.</li>",
                            "<li>You gain temporary hitpoints equal to 3 * your number of levels in Barbarian. Any remaining temporary hit points are lost upon your battle fury ending.</li></ul>",
                            "You can enter a battle fury the number of levels you have in Barbarian per rest."
                        ]
                    },
                    {
                        "Name": "Endure",
                        "Description": [
                            "Your body has become accustomed to the strain and stress you subject it to. At the second level, when forced to make a <b>Reflex Saving Throw</b> to avoid damage, you can choose to make a <b>Constitution Saving Throw</b> instead."
                        ]
                    },
                    {
                        "Name": "Danger Sense",
                        "Description": [
                            "At the third level, you gain an uncanny sense when danger is nearby. You gain advantage when making Reflex saving throws against effects you can see or hear. You cannot use this ability if you are blinded and deafened."
                        ]
                    },
                    {
                        "Name": "Reckless Attack",
                        "Description": [
                            "Without formal training, you sieze every opportunity your opponent gives you to strike, regardless of the position it puts you in. At the fourth level, you gain advantage on all attack rolls until the start of your next turn, but all attacks against you also have advantage."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Fast Movement",
                        "Description": [
                            "At the seventh level, your movement speed increases by 10 feet. You additionally gain a swim and climb speed equal to half of your movement speed (rounded down to the nearest multiple of 5) while in a battle fury."
                        ]
                    },
                    {
                        "Name": "Improved Danger Sense",
                        "Description": [
                            "At the eighth level, your Danger Sense has improved to the point that cannot be surprised. You gain advantage on all initiative rolls."
                        ]
                    },
                    {
                        "Name": "Brutal Critical",
                        "Description": [
                            "At the ninth level, when you score a critical hit, you automatically do maximum damage."
                        ]
                    },
                    {
                        "Name": "Indomitable",
                        "Description": [
                            "At the tenth level, once per rest, when you fail a Saving Throw, you can choose to succeed."
                        ]
                    },
                    {
                        "Name": "Relentless Focus",
                        "Description": [
                            "At the eleventh level, your Battle Fury can keep you fighting regardless of your wounds. If you drop to 0 hit points while in a Battle Fury, make a DC 10 Constitution Saving Throw. The DC increases by 5 after each success, and resets to DC 10 after a rest.",
                            "On a success, you can choose to remain conscious. However, you still take the damage as normal (this does mean you will likely have a negative hp). All damage you take until you fall unconscious will be applied when you fall unconscious - if your hit points become more negative than your maximum hit points, your character will immediately die."
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Sorcerer",
                "Skill Modifier Bonuses": "You gain a +2 increase to <b>Acrana</b>, and a +1 increase to two of the following skills. You cannot choose any skill more than once. <b>History</b>, <b>Mental Fortitude</b>, <b>Tradition</b> (of your Culture or Sorcerous Origin)",
                "Tool Modifier Bonuses": "None",
                "Weapon Modifier Bonuses": "You gain a +1 modifier increase to one weapon group of your choice.",
                "Spellcasting Modifier Bonuses": "You gain a +2 modifier increase to two schools of magic of your choice, and an additional +1 modifier to 2 other schools of magic",
                "Armor Training": "None",
                "Shield Training": "You are not trained with <b>Shields</b>.",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Primary Spellcasting Skill": "<b>Arcana</b>",
                "Number of Spells Known": [
                    "At the first level, you know 4 + your <b>Arcana</b> Modifier spells.",
                    "Upon a level up, you learn 1 spell. Whenever your <b>Arcana</b> Modifier increases, you learn an additional spell."
                ],
                "Features": [
                    {
                        "Name": "Sorcerous Origin",
                        "Description": [
                            "At the first level, your magical bloodline presents itself. Choose from one of the following origins:"
                        ],
                        "Options": [
                            {
                                "Name": "Draconic",
                                "Description": [
                                    "Somewhere in your family history lies a dragon, or at least a blessing from a dragon. You can speak, read and write Draconic.",
                                    "Additionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren’t wearing armor, your skin provides a +1 armor bonus to your AC."
                                ]
                            },
                            {
                                "Name": "Elemental",
                                "Description": [
                                    "Your bloodline has elemental influences within it. Choose one of the basic elements: Air, Earth, Fire or Water.",
                                    "<b>Air</b> You learn the Gust spell. It does not count towards your known spells, and you can cast it without using mana. Additionally, you can speak, read and write Auran.",
                                    "<b>Earth</b> You learn the Mold Earth spell. It does not count towards your known spells, and you can cast it without using mana. Additionally, you can speak, read and write Terran.",
                                    "<b>Fire</b> You learn the Control Flames spell. It does not count towards your known spells, and you can cast it without using mana. Additionally, you can speak, read and write Ignan.",
                                    "<b>Water</b> You learn the Shape Water spell. It does not count towards your known spells, and you can cast it without using mana. Additionally, you can speak, read and write Augan."
                                ]
                            },
                            {
                                "Name": "Shadow",
                                "Description": [
                                    "Something dark and magically powerful touched your bloodline. You always full the pull of this darkness, attempting to draw you closer to its worlds beyond the physical plane. You gain Darkvision to 120 feet. If you already have Darkvision, its range increases by 120 feet.",
                                    "Additionally, when rolling Death Saving Throws, a roll of 10 is counted as a success rather than a failure."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "Wild Magic",
                        "Description": [
                            "Starting at the second level, your spellcasting can unleash surges of untamed magic. Immediately after you cast a spell where you rolled a 1 or a 20, a Wild Magic Surge occurs. A Wild Magic Surge can happen once per turn.",
                            "When a Wild Magic Surge happens, roll a d100, and refer to the table on the next page. If a spell is cast, it is never considered concentration - any concentration spell casted from Wild Magic ends its effects on the end of your next turn.",
                            "<table class=\"table table-striped table-hover\"><thead><tr><th>Roll</th><th>Effect</th></tr></thead><tbody><tr><td>1-2</td><td>A random spell from your list is cast, at a random location. If the spell targets a creature and there is no creature in the location, the spell automatically misses.</td></tr><tr><td>3-4</td><td>For the next minute, you can see any invisible creature if you have line of sight to it.</td></tr><tr><td>5-6</td><td>A modron chosen and controlled by the DM appears in an unoccupied space within 5 feet of you, then disappears 1 minute later.</td></tr><tr><td>7-8</td><td>The next time you take magical damage in the next minute, you take maximum damage</td></tr><tr><td>9-10</td><td>You cast magic missile</td></tr><tr><td>11-12</td><td>Roll a d10. Your height changes by a number of inches equal to the roll. If the roll is odd, you shrink. If the roll is even, you grow.</td></tr><tr><td>13-14</td><td>You cast confusion on yourself</td></tr><tr><td>15-16</td><td>For the next minute, you regain 5 hit points at the start of each of your turns.</td></tr><tr><td>17-18</td><td>You grow a long beard made of feathers that remains until you sneeze, at which point the feathers explode out from your face.</td></tr><tr><td>19-20</td><td>You cast grease on yourself</td></tr><tr><td>21-22</td><td>Creatures have disadvantage on saving throws against the next spell you cast in the next minute that involves a saving throw.</td></tr><tr><td>23-24</td><td>Your skin turns a vibrant shade of blue. A level 1 Remove Curse can end this effect.</td></tr><tr><td>25-26</td><td>An eye appears on your forehead for the next minute. During that time, you have advantage on Perception Checks that rely on sight.</td></tr><tr><td>27-28</td><td>For the next minute, all your spells with a casting time of 1 action have a casting time of 1 bonus action.</td></tr><tr><td>29-30</td><td>You teleport up to 60 feet to an unoccupied space of your choice that you can see.</td></tr><tr><td>31-32</td><td>You are transported to the Astral Plane until the end of your next turn, after which time you return to the space you previously occupied or the nearest unoccupied space if that space is occupied.</td></tr><tr><td>33-34</td><td>Maximize the damage of the next damaging spell you cast within the next minute.</td></tr><tr><td>35-36</td><td>Roll a d10. Your age changes by a number of years equal to the roll. If the roll is odd, you get younger (minimum 1 year old). If the roll is even, you get older.</td></tr><tr><td>37-38</td><td>1d6 flumphs controlled by the DM appear in unoccupied spaces within 60 feet of you and are frightened of you. They vanish after 1 minute.</td></tr><tr><td>39-40</td><td>You regain 2d10 hit points.</td></tr><tr><td>41-42</td><td>You turn into a potted plant until the start of your next turn. While a plant, you are incapacitated and have vulnerability to all damage. If you drop to 0 hit points, your pot breaks, and your form reverts.</td></tr><tr><td>43-44</td><td>For the next minute, you can teleport up to 20 feet as an Ability Action on each of your turns.</td></tr><tr><td>45-46</td><td>You cast levitate on yourself.</td></tr><tr><td>47-48</td><td>A unicorn controlled by the LM appears in a space within 5 feet of you, then disappears 1 minute later.</td></tr><tr><td>49-50</td><td>You can’t speak for the next minute. Whenever you try, pink bubbles float out of your mouth.</td></tr><tr><td>51-52</td><td>A spectral shield hovers near you for the next minute, granting you a +2 bonus to AC and immunity to magic missile.</td></tr><tr><td>53-54</td><td>You are immune to being intoxicated by alcohol for the next 5d6 days.</td></tr><tr><td>55-56</td><td>Your hair falls out but grows back within 24 hours.</td></tr><tr><td>57-58</td><td>For the next minute, any flammable object you touch that isn’t being worn or carried by another creature bursts into flame.</td></tr><tr><td>59-60</td><td>You regain 2 mana.</td></tr><tr><td>61-62</td><td>For the next minute, you must shout when you speak.</td></tr><tr><td>63-64</td><td>You cast fog cloud centered on yourself.</td></tr><tr><td>65-66</td><td>You lose 2 mana.</td></tr><tr><td>67-68</td><td>You are frightened by the nearest creature until the end of your next turn.</td></tr><tr><td>69-70</td><td>Each creature within 30 feet of you becomes invisible for the next minute. The invisibility ends on a creature when it attacks or casts a spell.</td></tr><tr><td>71-72</td><td>You gain resistance to all damage for the next minute.</td></tr><tr><td>73-74</td><td>You gain vulnerability to all damage for the next minute.</td></tr><tr><td>75-76</td><td>You glow with bright light in a 30-foot radius for the next minute. Any creature that ends its turn within 5 feet of you is blinded until the end of its next turn.</td></tr><tr><td>77-78</td><td>You cast polymorph on yourself. If you fail the saving throw, you turn into a sheep for the spell’s duration.</td></tr><tr><td>79-80</td><td>Illusory butterflies and flower petals flutter in the air within 10 feet of you for the next minute.</td></tr><tr><td>81-82</td><td>You can take one additional action immediately.</td></tr><tr><td>83-84</td><td>Each creature within 30 feet of you (including yourself) takes 1d10 necrotic damage.</td></tr><tr><td>85-86</td><td>You cast mirror image.</td></tr><tr><td>87-88</td><td>You cast fly on a random creature within 60 feet of you.</td></tr><tr><td>89-90</td><td>You become invisible for the next minute. During that time, other creatures can’t hear you. The invisibility ends if you attack or cast a spell.</td></tr><tr><td>91-92</td><td>You lose your action for next turn.</td></tr><tr><td>93-94</td><td>Your size increases by one size category for the next minute.</td></tr><tr><td>95-96</td><td>You lose all mana.</td></tr><tr><td>97-98</td><td>You are surrounded by faint, ethereal music for the next minute.</td></tr><tr><td>99-100</td><td>You regain all expended mana.</td></tr></tbody></table>"
                        ]
                    },
                    {
                        "Name": "Elemental Adept",
                        "Description": [
                            "At the third level, your start to focus on one type of spell damage. Choose a type of magical damage of your choice. When you deal this type of damage from a spell, you are able to add your Evocation Spellcasting Modifier to the damage of the spell. If you are already adding your Evocation Spellcasting Modifier to the damage of the spell, add the modifier again."
                        ]
                    },
                    {
                        "Name": "Metamagic",
                        "Description": [
                            "At the fourth level, you begin to manifest abilities related to spells that only a magical bloodline can perform. Choose two of the following options. When Metamagic is used. Roll a d20. On a roll of a 1, a Wild Magic Surge occurs.",
                            "<i>Optionally</i>, instead of rolling a d20 to determine if a Wild Magic Surge happens, it always happens when Metamagic is used."
                        ],
                        "Options": [
                            {
                                "Name": "Distant Spell",
                                "Description": [
                                    "When you cast a spell that has a range of 5 feet or greater, you can spend 1 spell point to double the range of the spell.",
                                    "When you cast a spell that has a range of touch, you can spend 1 spell point to make the range of the spell 30 feet."
                                ]
                            },
                            {
                                "Name": "Extended Spell",
                                "Description": [
                                    "When you cast a spell that has a duration of 1 minute or longer, you can spend 1 spell point to double its duration, to a maximum duration of 24 hours."
                                ]
                            },
                            {
                                "Name": "Heightened Spell",
                                "Description": [
                                    "When you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 mana to give one target of the spell disadvantage on its first saving throw made against the spell."
                                ]
                            },
                            {
                                "Name": "Quickened Spell",
                                "Description": [
                                    "When you cast a spell that has a casting time of 1 action, you can spend 2 mana to change the casting time to 1 ability action for this casting."
                                ]
                            },
                            {
                                "Name": "Seeking Spell",
                                "Description": [
                                    "If you make an attack roll for a spell and miss, you can spend 2 mana to reroll the d20, and you must use the new roll.",
                                    "You can use Seeking Spell even if you have already used a different Metamagic option during the casting of the spell."
                                ]
                            },
                            {
                                "Name": "Subtle Spell",
                                "Description": [
                                    "When you cast a spell, you can spend 1 spell point to cast it without any somatic or verbal components.",
                                    "To be eligible, a spell must be incapable of targeting more than one creature at the spell’s current level."
                                ]
                            },
                            {
                                "Name": "Twinned Spell",
                                "Description": [
                                    "When you cast a spell that targets only one creature and doesn’t have a range of self, you can spend a number of mana as determined in the below table to target a second creature in range with the same spell.\n<table class=\"table table-striped table-hover\"><thead><tr><td>Spell Level</td><td>Mana Cost</td></tr></thead><tbody><tr><td>1</td><td>1</td><tr><td>2</td><td>2</td><tr><td>3</td><td>3</td><tr><td>4</td><td>5</td><tr><td>5</td><td>8</td><tr><td>6</td><td>13</td></tr></tbody></table>"
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Improved Elemental Adept",
                        "Description": [
                            "At the seventh level, your understanding of your chosen damage type increases. You gain resistance to that type of damage (both magical and nonmagical)."
                        ]
                    },
                    {
                        "Name": "Improved Metamagic",
                        "Description": [
                            "At the eighth level, you acquire two more metamagic options as presented in the level four ability. You cannot choose the same option twice."
                        ]
                    },
                    {
                        "Name": "Tides of Chaos",
                        "Description": [
                            "Starting at ninth level, you can manipulate the forces of chance and chaos to gain advantage on one attack roll, ability check, or saving throw. You can use this feature a number of times equal to your Sorcerer level per rest.",
                            "When you use this ability, roll a d20. Upon a roll of a 1, a Wild Magic Surge occurs."
                        ]
                    },
                    {
                        "Name": "Spell Bombardment",
                        "Description": [
                            "Beginning at tenth level, the harmful energy of your spells intensifies. When you roll damage for a spell and roll the highest number possible on any of the dice, choose one of those dice, roll it again and add that roll to the damage. You can use the feature only once per turn."
                        ]
                    },
                    {
                        "Name": "Master Elemental Adept",
                        "Description": [
                            "At the eleventh level, you become a master of your chosen element. You are able to ignore resistance for your chosen damage type, and creatures that are immune to the damage type are only resistant to your spells that deal this damage."
                        ]
                    }
                ]
            }
        },
        {
            "Name": "Novitiate",
            "Description": "Some people undergo formal training to excel in abilities useful to adventurers. These Novitiates all have all attended a school or camp which has honed these skills.",
            "Martial Archetype": {
                "Name": "Fighter",
                "Skill Modifier Bonuses": "You gain as +1 increase to the skill modifier of 3 of the following skills. You cannot choose any skill more than once. <b>Athletics</b>, <b>Constitution</b>, <b>Endurance</b>, <b>Intimidation</b>, <b>Medicine</b>, <b>Mental Fortitude</b>, <b>Perception</b>, <b>Reflex</b>, <b>Stealth</b>",
                "Tool Modifier Bonuses": "None",
                "Weapon Modifier Bonuses": "You gain a +2 weapon bonus to any 3 weapon groups and a +1 weapon bonus to all others. You cannot choose the same weapon group more than once.",
                "Armor Training": "You are trained with <b>all</b> armor types",
                "Shield Training": "You are trained with <b>Shields</b>",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Features": [
                    {
                        "Name": "Second Wind",
                        "Description": [
                            "At the first level, once per combat, you are able to redouble your efforts and gain temporary hitpoints equal to your number of levels in Fighter. Any temporary hit points leftover are lost after combat."
                        ]
                    },
                    {
                        "Name": "Combat Agility",
                        "Description": [
                            "At the second level, your speed allows you to perform some actions more quickly. You use your ability action to take the Dash, Disengage, Dodge or Hide actions."
                        ]
                    },
                    {
                        "Name": "Tactician",
                        "Description": [
                            "At the third level, your battle senses heighten to the point that you are able to take the Help action as a bonus action."
                        ]
                    },
                    {
                        "Name": "Enhanced Fighting Style",
                        "Description": [
                            "At the fourth level, your fighting style has improved, and you have gained new abilities related to <b>Fighting Style</b> at two levels in the Martial archetype."
                        ],
                        "Options": [
                            {
                                "Name": "Ambush",
                                "Description": [
                                    "You gain advantage when attempting to hide from an enemy that is currently engaged against another foe, whether it’s a party member or NPC. Additionally, your extra damage when attacking a foe who does not know you are present increases to 2d6."
                                ]
                            },
                            {
                                "Name": "Archery",
                                "Description": [
                                    "You gain the ability to focus on your target. You can use your movement (you cannot move at all for the round of combat) to gain advantage on your next attack. Additionally, your bonus to attack rolls for ranged weapons increases to +2."
                                ]
                            },
                            {
                                "Name": "Blind Fighting",
                                "Description": [
                                    "Your Blindsight increases to a range of 15 ft, and you roll with advantage when detecting creatures within range of your Blindsight."
                                ]
                            },
                            {
                                "Name": "Defense",
                                "Description": [
                                    "You gain the ability to extend your protection to allies within 5 ft of you. While wielding a melee weapon, you are able to use your reaction to extend your weapon bonus to your armor class to an ally within 5 ft of you. While wielding a shield, you are able to use your reaction to add your shield bonus to your armor class to an ally’s armor class. Additionally, your weapon bonus to your armor class increase by +2 while wielding a melee weapon."
                                ]
                            },
                            {
                                "Name": "Dual Wielding",
                                "Description": [
                                    "You are able to add your weapon ability modifier to the damage of your offhand weapon or to the second attack of a double-ended weapon. Additionally, your attack bonus to all double-ended weapons and when wielding multiple weapons increases to +2."
                                ]
                            },
                            {
                                "Name": "Dueling",
                                "Description": [
                                    "When you are wielding a melee weapon in one hand and no other weapons, your attacks deal an extra 1d4 damage. Additionally, your attack bonus when wielding a melee weapon in one hand and no other weapons increases to +2."
                                ]
                            },
                            {
                                "Name": "Great Weapon Fighting",
                                "Description": [
                                    "While wielding a weapon in two hands, you can reroll your damage rolls and take the higher sum. Additionally, your attack bonus for while using a weapon with 2 hands increases to +2."
                                ]
                            },
                            {
                                "Name": "Thrown Weapon Fighting",
                                "Description": [
                                    "Your precision has increased that you are able to ignore Half Cover when throwing a weapon. Additionally, your attack bonus while using thrown weapons increases to +2."
                                ]
                            },
                            {
                                "Name": "Unarmed Fighting",
                                "Description": [
                                    "Your weapon die for unarmed strikes increases by one level (1d4 becomes 1d6, 1d12 becomes 2d8). Additionally, your attack bonuses for unarmed strikes increases to +2."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Second Fighting Style",
                        "Description": [
                            "At the sixth level, you gain a second fighting style as presented at in the Level 2 Martial ability. You cannot choose the same fighting style twice. At your LM’s discretion, you can change your chosen secondary fighting style upon finishing a rest."
                        ]
                    },
                    {
                        "Name": "Action Surge",
                        "Description": [
                            "At the seventh level, once per rest, you can make an additional action during one round of combat."
                        ]
                    },
                    {
                        "Name": "Advanced Fighting Style",
                        "Description": [
                            "At the eighth level, your primary fighting style has improved even more, allowing for greater benefits."
                        ],
                        "Options": [
                            {
                                "Name": "Ambush",
                                "Description": [
                                    "You have an uncanny sense of how to hide and perform deadly strikes. You gain advantage on initiative rolls when ambushing, and your crit range increases by 2 when your opponent doesn’t know you are present. This bonus will generally mean your crit range is 18 - 20, but this range increase does stack with other range increases. Additionally, your extra damage when attacking a foe who does not know you are present increases to 3d6."
                                ]
                            },
                            {
                                "Name": "Archery",
                                "Description": [
                                    "You have become a master marksman and no longer have disadvantage when a foe is within 5 feet of you. Additionally, your attack bonus with ranged weapons increases to +3."
                                ]
                            },
                            {
                                "Name": "Blind Fighting",
                                "Description": [
                                    "Your Blindsight increases to 25 ft, and you cannot be surprised by creatures within range of your Blindsight. Additionally, if combat starts from a creature within 25 ft of your Blindsight, you gain advantage on the initiative roll."
                                ]
                            },
                            {
                                "Name": "Defense",
                                "Description": [
                                    "Assuming you have the movement remaining to reach you ally, when you use your reaction to extend your weapon bonus to your armor class or to extend your shield bonus to your armor class, you are able to move to protect the ally. As part of this reaction, you are able to impose disadvantage against one attack against this ally for this round of combat. Additionally, your weapon bonus to your armor class increases to +3 while wielding a melee weapon."
                                ]
                            },
                            {
                                "Name": "Dual Wielding",
                                "Description": [
                                    "If you have an Extra Attack class feature, you gain an extra attack while wielding two melee weapons or a double-ended weapon. This does mean that if you have the Extra Attack (2) class feature, you would be able to make 5 attacks in one round of combat (1 from taking the attack action, 2 from Extra Attack (2), 1 from Advanged Duel Wielding, 1 from offhand attacking with your ability action). Additionally, your attack bonus to all double-ended weapons and when wielding multiple weapons increases to +3."
                                ]
                            },
                            {
                                "Name": "Dueling",
                                "Description": [
                                    "While wielding a weapon in one hand and no other weapons, your weapon gains the deflect ability. If your weapon already has the Deflect property, roll an additional d4 to the damage deflected. If your deflect reduces the damage to 0, assuming the enemy is within your melee weapon range, you can make a melee attack against your opponent as part of your Deflect reaction. Additionally, your attack bonus when wielding a melee weapon in one hand and no other weapons increases to +3."
                                ]
                            },
                            {
                                "Name": "Great Weapon Fighting",
                                "Description": [
                                    "Your weapon sweeps have become fast enough that when the intended target is able to avoid your attack, you are occasionally able to hit a second target within the arc of your sweep. When you are wielding a weapon with both hands, miss an attack, and there is a second enemy within melee attack range of you that’s adjacent to your original target, you may choose to make an attack with disadvantage against this second enemy. In addition, your attack bonus for while using a weapon with 2 hands increases to +3."
                                ]
                            },
                            {
                                "Name": "Thrown Weapon Fighting",
                                "Description": [
                                    "Your attack bonus while using thrown weapons increases to +3. You can choose to forgo this increase to your attack bonus for an extra +6 damage upon a hit."
                                ]
                            },
                            {
                                "Name": "Unarmed Fighting",
                                "Description": [
                                    "Your fists become a flurry of blows. In conjuncture with the Unarmed Strike Master Ability, when you choose to use your ability action to make an attack, you can make two attacks instead of one during this ability action. If you do not have the Unarmed Strike Master Ability, you can make one Unarmed Strike attack as an Ability Action.",
                                    "Additionally, your attack bonuses for unarmed strikes increases to +3."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "Uncanny Dodge",
                        "Description": [
                            "At the ninth level, you can nimbly dodge out of the way of an effect. When you are subjected to a Reflex Saving Throw to avoid damage, if you succeed, you take no damage. Additionally, if you fail, you only take half damage."
                        ]
                    },
                    {
                        "Name": "Indomitable",
                        "Description": [
                            "At the tenth level, once per rest, when you fail a Saving Throw, you can choose to succeed."
                        ]
                    },
                    {
                        "Name": "Extra Attack (2)",
                        "Description": [
                            "At the eleventh level, when you take the attack action, you can make three attacks as part of one action. This ability does not stack with another “Extra Attack” class ability."
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Wizard",
                "Skill Modifier Bonuses": "You gain a +2 modifier to <b>Arcana</b>, and a +1 increase to the skill modifier of 2 of the following skills. You cannot choose any skill more than once. <b>History</b>, <b>Mental Fortitude</b>, <b>Reflex</b>, <b>Riddle</b>, <b>Tradition</b> (of your choice)",
                "Tool Modifier Bonuses": "None",
                "Weapon Modifier Bonuses": "None",
                "Spellcasting Modifier Bonuses": "You gain a +2 modifier increase to any 3 schools of magic, and an additional +1 modifier to all others",
                "Armor Training": "None",
                "Shield Training": "You are not trained with <b>Shields</b>",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Primary Spellcasting Skill": "<b>Arcana</b>",
                "Number of Spells Known": [
                    "At the first level, you know 5 + your <b>Arcana</b> Modifier spells.",
                    "Upon a level up, you learn 2 spells. Whenever your <b>Arcana</b> Modifier increases, you learn an additional spell."
                ],
                "Features": [
                    {
                        "Name": "Prestidigitation",
                        "Description": [
                            "At the first level, you learn a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within 10 feet:",
                            "<ul><li>You create an instantaneous, harmless sensory effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor.</li><li>You instantaneously light or snuff out a candle, a torch, or a small campfire.</li><li>You instantaneously clean or soil an object no larger than 1 cubic foot.</li><li>You chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour.</li><li>You make a color, a small mark, or a symbol appear on an object or a surface for 1 hour.</li><li>You create a nonmagical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn.</li></ul>",
                            "If you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action."
                        ],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Ritual Casting",
                        "Description": [
                            "At the second level, you can cast any spell with a normal casting time of 1 hour or less as a ritual. Spells cast in this manner cost no mana to cast, but take 10x longer to cast. Spells with a casting time of an Ability Action or a Reaction can be cast in this manner with a casting time of 1 minute."
                        ]
                    },
                    {
                        "Name": "Magical Spellbook",
                        "Description": [
                            "At the third level, your usage of your spellbook has extended from just a repository of spells; you have formed a magical connection with your book. While you are holding your spellbook, the book functions as your spellcasting focus.",
                            "Additionally, if you ever lose your spellbook or have it stolen, you are able to magically teleport your book back into your possession with an Ability Action wave of your hand. Your and your spellbook must be on the same plane of existance for the teleportation to work. This ability is considered an unnamed Conjuration spell.",
                            "Finally, if your spellbook is ever destroyed, you can magically recreate your spellbook by expending mana equal to the number of levels in Magic archetypes over the course of a minute. Your spellbook will be the same as it was before it was destroyed. This ability is considered an unnamed Transmutation spell."
                        ]
                    },
                    {
                        "Name": "Enhanced Spellcasting Specialization",
                        "Description": [
                            "At the fourth level, your knowledge of your choosen school of magic increases. You have gained new abilities related to the school of magic specialization chosen at the second level."
                        ],
                        "Options": [
                            {
                                "Name": "Abjuration",
                                "Description": [
                                    "Your studies into Abjuration magic allows you to redirect some of the magic into the spell back to yourself. Once per rest, when you cast an Abjuration spell, you can pull a strand of the magic and surround yourself with it, giving you temporary hit points equal to your Abjuration spell modifier.",
                                    "Additionally, your bonus to your Abjuration Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Conjuration",
                                "Description": [
                                    "Your studies into Conjuration magic allow you to better teleport. Once per rest, you can teleport up to 30 feet to an unoccupied space you can see.",
                                    "Additionally, your bonus to your Conjuration Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Divination",
                                "Description": [
                                    "Your ability to see beyond begins to manifest physically. You gain Darkvision with a range of 60 feet. If you already have Darkvision, the range expands by 60 feet.",
                                    "Additionally, your bonus to your Divination Spell Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Enchantment",
                                "Description": [
                                    "Your knowledge of Enchantment magic allows you to subtlely shift the direction it flows. Once per rest when you cast an Enchantment spell that targets one creature, you can make the spell target 2 creatures.",
                                    "Additionally, your bonus to your Enchantment Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Evocation",
                                "Description": [
                                    "Your experience with Evocation magic allows you to sculpt Evocation spells you cast. Once per rest, when you cast an area of effect Evocation spell, you can make a number of pockets up to or equal to your Evocation Spellcasting Modifier within the spell’s range that are not affected by the spells effects.",
                                    "Additionally, your bonus to your Evocation Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Illusion",
                                "Description": [
                                    "Your studies into Illusion magic make it your go-to solution. Once per rest when you are attacked, you can use your reaction to create an illusion of yourself just in front of yourself. The attacker will automatically hit this illusion, which dispels it.",
                                    "Additionally, your bonus to your Illusion Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Malediction",
                                "Description": [
                                    "Your understanding of Malediction magic allows you to kick your enemies while they’re down. When you attack a creature affected by one of your Malediction spells, you deal extra damage equal to your Malediction Spellcasting Modifier.",
                                    "Additionally, your bonus to your Malediction Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Necromancy",
                                "Description": [
                                    "Your studies into Necromancy magic have given you a better understanding of life forces and how to manipulate them to your benefit. Once per rest, when you kill a creature that is not an undead or a construct with a Necromancy spell, you regain hitpoints equal to your Necromancy Spellcasting Modifier (up to your hit points maximum).",
                                    "Additionally, your bonus to your Necromancy Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Transmutation",
                                "Description": [
                                    "Your studies into Transmutation magic have given you a better understanding of how magic flows. Once per rest, when you cast a Transmutation spell, you regain Mana equal to half of your Transmutation Spellcasting Bonus.",
                                    "Additionally, your bonus to your Transmutation Spellcasting Modifier increases to +2."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Second Spellcasting Specialization",
                        "Description": [
                            "When you reach the sixth level, you gain a second school of magic specialization as presented in the level 2 magic archetype ability. You cannot choose the same specialization twice. At your LM’s discretion, you can change your chosen secondary school of magic specialization upon finishing a rest."
                        ]
                    },
                    {
                        "Name": "Scrivener",
                        "Description": [
                            "At the seventh level, your knowledge of magic allows you to create spell scrolls. In order to do so, you need to use Calligrapher’s Supplies and spend an hour writing the scroll and imbuing the scroll with magic. Make a Calligrapher’s Supplies Arcana check against a DC of 20 + the level of spell that you are attempting to apply to the scroll. Upon a success, your scroll has successfully been made. Upon a failure, the scrolls burns itself as if it had just been used.",
                            "Regardless of the outcome of your check, you expend mana as if you had just cast the spell."
                        ]
                    },
                    {
                        "Name": "Advanced Spellcasting Specialization",
                        "Description": [
                            "At the eighth level, your focus has allowed you to delve more deeply. Your primary School of Magic Specialization (chosen at Level 2) benefits increases further."
                        ],
                        "Options": [
                            {
                                "Name": "Abjuration",
                                "Description": [
                                    "Your understanding of Abjuration magic allows you to better control the strands of magic you manipulate. You can use this ability twice per rest now, and you can choose any creature within 30 feet to be the target.",
                                    "Additionally, your bonus to your Abjuration Spellcasting Modifier increases to +3."
                                ]
                            },
                            {
                                "Name": "Conjuration",
                                "Description": [
                                    "Your mastery of Conjuration magic allows creatures you summon to be more durable. Any creature you summon gains temporary hit points equal to your Wizard level + your Conjuration Spellcasting Modifier.",
                                    "Additionally, your bonus to your Conjuration Spellcasting Modifier increases to +3."
                                ]
                            },
                            {
                                "Name": "Divination",
                                "Description": [
                                    "Your understanding of Divination magic allows you to catch glimpses into the future. Once per rest, roll a d20 and record the roll. You can replace one attack roll, saving throw, skill check or tool check made by yourself or a creature you can see with the number rolled on the dice. You must decide to use this roll prior to the creature making their roll. If you do not use this ability prior to a rest, the d20 roll you made is lost.",
                                    "Additionally, your bonus to your Divination Spell Modifier increases to +3."
                                ]
                            },
                            {
                                "Name": "Enchantment",
                                "Description": [
                                    "Your understanding of Enchantment magic has deepened to the point that you can affect a creature’s perception of the effects. When you can an Enchantment spell on a target, you change the creature’s understanding so they are unaware that you charmed them.",
                                    "Additionally, your bonus to your Enchantment Spellcasting Modifier increases to +3."
                                ]
                            },
                            {
                                "Name": "Evocation",
                                "Description": [
                                    "Your understanding of Evocation magic has become so strong that you can more effectively target your foes. When you cast an Evocation spell that deals damage, you can add your Evocation Spellcasting Modifier to the damage of the spell. If you cast an area of effect spell, only the target at the center of the spell takes this extra damage.",
                                    "Additionally, your bonus to your Evocation Spellcasting Modifier increases to +3."
                                ]
                            },
                            {
                                "Name": "Illusion",
                                "Description": [
                                    "Your understanding of Illusion magic allow you to create a stronger reactive illusion. When you use your reaction to create the illusion of yourself in front of your attacker, the attacker must make an attack roll against the illusion against an AC of 10 + your Illusion Spellcasting Modifier.",
                                    "Upon a hit, the illusion fades as before. Upon a miss, the attacker must make a Perception Saving Throw against your Illusion Spellcasting DC. Upon a failure, they believe that the illusion is you. Should they attack you while they believe this illusion is you, they will attack the illusion until dispelled, or they pass their Perception Saving Throw.",
                                    "Additionally, your bonus to your Illusion Spellcasting Modifier increases to +3."
                                ]
                            },
                            {
                                "Name": "Malediction",
                                "Description": [
                                    "Your mastery of Malediction magic allows your curses to become even more potent. When you cast a Malediction spell that hits its target, or the target fails their saving throw, they take Force damage equal to your Malediction Spellcasting Modifier.",
                                    "Additionally, your bonus to your Malediction Spellcasting Modifier increases to +3."
                                ]
                            },
                            {
                                "Name": "Necromancy",
                                "Description": [
                                    "Your mastery of Necromancy magic allows you to create stronger undead. Any undead created by a spell you cast gain hitpoints equal to your Wizard level + your Necromancy Spellcasting Modifier, and they deal extra necrotic damage equal to half of your Necromancy Spellcasting Modifier.",
                                    "Additionally, your bonus to your Necromancy Spellcasting Modifier increases to +3."
                                ]
                            },
                            {
                                "Name": "Transmutation",
                                "Description": [
                                    "Your mastery over Transmutation magic gives you the ability to mutate stone. Once per rest, you can attempt to turn a creature into stone, as if you had targeted it with the spell Petrication. Alternatively, you can attempt to cure a creature that is petrified. In order to cure the creature, you must pass a Transmutation check against the DC of the save that originally petrified your target.",
                                    "Additionally, your bonus to your Transmutation Spellcasting Modifier increases to +3."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "Arcane Concentration",
                        "Description": [
                            "At the ninth level, your understanding magic allows you to better control your magic in the middle of battle. You are able to add your Arcana modifier to Concentration checks."
                        ]
                    },
                    {
                        "Name": "Signature Spells",
                        "Description": [
                            "When your character reaches level ten, your specialization with your school of magic has further increased. Choose 6 spells whos School of Magic matches your primary Spellcasting Specialization - 1 level 3 spell, 2 level 2 spells, and 3 level 3 spells. For each of your chosen spells, the the first casting of each spell per rest is done without mana."
                        ]
                    },
                    {
                        "Name": "Power Surge",
                        "Description": [
                            "At the eleventh level, once per rest, you can cast a spell at 2x the mana cost. A spell cast in this manner will automatically hit, or the target(s) will automatically fail their saving throws, and any effects of this spell are maximized."
                        ]
                    }
                ]
            }
        },
        {
            "Name": "Outcast",
            "Description": "Not everyone fits into society. Outcasts, whether through banishment or their own choices, live in the wild an utilize the land in order to survive.",
            "Martial Archetype": {
                "Name": "Ranger",
                "Skill Modifier Bonuses": " You gain a +2 modifier to the following skills: <b>Nature</b>, <b>Stealth</b>, <b>Survival</b>. You additionally gain a +1 modifier to 3 of the following skills: <b>Animal Handling</b>, <b>Athletics</b>, <b>Constitution</b>, <b>Endurance</b>, <b>Investigation</b>, <b>Medicine</b>, <b>Mental Fortitude</b>, <b>Perception</b>, <b>Reflex</b>",
                "Tool Modifier Bonuses": "You gain a +2 modifier to 2 of the following tools: <b>Climber’s Kit</b>, <b>Cook’s Utensils</b>, <b>Fishing Equipment</b>, <b>Healer’s Kit</b>, <b>Herbalism Kit</b>, <b>Tinker’s Tools</b>.",
                "Weapon Modifier Bonuses": "You gain a +2 weapon bonus to <b>Bows and Slings</b>. You additionally gain a +2 weapon bonus to any 2 weapon groups that is not <b>Bows and Slings</b>.",
                "Armor Training": "You are trained in <b>Light</b> and <b>Medium armor</b>",
                "Shield Training": "You are trained in <b>Shields</b>",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Features": [
                    {
                        "Name": "Known Lands",
                        "Description": [
                            "You are particularly familiar with one region. You gain advantage when making any check related to knowledge of your known lands.",
                            "As your character explores and learns the terrain, fauna and flora of more regions, you gain more Known Lands. When this happens is up to your LM.",
                            "While traveling for an hour or more in your known lands, you gain the following benefits:<ul><li>Difficult terrain doesn’t slow your group’s travel.</li><li>Your group can’t become lost except by magical means.</li><li>Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.</li><li>If you are traveling alone, you can move stealthily at a normal pace.</li><li>When you forage, you find twice as much food as you normally would.</li><li></li>While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area.</ul>"
                        ]
                    },
                    {
                        "Name": "Hunter's Mark",
                        "Description": [
                            "At the second level, as an ability action, you take a moment to learn what you can about a target - what tracks they make, their size, how they move, and any weak spots that they appear to have.",
                            "While a target is marked, you have advantage when tracking it. Additionally, any successful attack you make against the target while it is marked deals damage equal to your number of levels in the Ranger archetype.",
                            "You can only have one target marked at a given time. If you take the time to mark a second target while your first target is still alive, the first target is no longer marked."
                        ]
                    },
                    {
                        "Name": "Primeval Awareness",
                        "Description": [
                            "At the third level, your time in the wild begins to shine. You always are on alert for potential danger and cannot be surprised.",
                            "Additionally, when in terrain that has game of some kind, you are always able to hunt food and find water for yourself and your companions."
                        ]
                    },
                    {
                        "Name": "Animal Companion",
                        "Description": [
                            "At the fourth level, your bond with nature has strengthened to the point that you begin to understand bestial languages. While you may not be able to speak verbally to any given animal, you are able to accurately understand their body language, allowing you to forge bonds with creatures in the wild.",
                            "You gain a beast companion that accompanies you on your adventures and is trained to fight alongside you. Choose a beast that is no larger than Medium and that has a challenge rating of 1/4 or lower.",
                            "For every level you go up, your animal companion’s Health increases by their Constitution modifier. This does mean that their health will increase by 4 * their Constitution modifier when you initially get them. Likewise, their weapon and skill modifiers will increase on a roll of a natural 20 like any other scalable roll. This increased modifier is only effective on the companion that it is rolled on. Should your companion die or leave, your new companion’s modifiers will be back to their initial ones.",
                            "The beast obeys your commands as best as it can. It takes its turn on your initiative. On your turn, you can verbally command the beast where to move (no action required by you). You can use your ability action to verbally command it to take the Attack, Dash, Disengage, or Help action. Your beast will follow it as best as it can, and will keep following the command until a new one is given. If you don’t issue a command, or the beast completes your command, the beast takes the Dodge action.",
                            "If you are incapacitated or absent, your beast companion acts on its own, focusing on protecting you and itself. It never requires your command to use its reaction, such as when making an opportunity attack.",
                            "While traveling through your favored terrain with only the beast, you can move stealthily at a normal pace.",
                            "If the beast dies, you can obtain another one by spending 8 hours bonding with another beast that isn’t hostile to you, either the same type of beast as before or a different one."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Favored Enemy",
                        "Description": [
                            "At the seventh level, you have significance experience studying, tracking, hunting, and even talking to a certain type of enemy.",
                            "Choose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies.",
                            "You have advantage on any check to track or recall information about your favored enemies. Your exception knowledge of each enemy gives you insight into their weak spots. Any successful attack you make against them deals an extra 1d6 damage.",
                            "For each enemy, your gain the ability to speak one standard language they speak, assuming they have a language.",
                            "With the permission of your LM, you can change your favored enemies as your character and campaign evolves."
                        ]
                    },
                    {
                        "Name": "Pass Without Trace",
                        "Description": [
                            "At the eighth level, your time hunting begins to wear off on your companions.",
                            "While in your known lands, you and your party automatically pass stealth checks. Outside of them, you and your party gain a +5 bonus to your roll. While in combat you can use your ability action to hide (but not your party unless they have an ability that allows them to hide as an ability action)."
                        ]
                    },
                    {
                        "Name": "Feral Senses",
                        "Description": [
                            "At the ninth level, your time in the wild has taught you to hone senses other than your eyes. You gain a blind sight of 30 feet. If you are Blinded and Deafened, this range is reduced to 10 feet."
                        ]
                    },
                    {
                        "Name": "Wild Warrior",
                        "Description": [
                            "At the tenth level, your extreme knowledge of the wild becomes evident in your actions. You gain the following effects:<ul><li>You gain a climbing speed of 20 feet. If you already have a climbing speed, it increases by an additional 20 feet.</li><li>You gain advantage on all initiative rolls.</li><li>While in the wild, your <b>Passive Stealth</b>, <b>Passive Nature</b> and <b>Passive Survival</b> becomes 11 + your skill modifier (rather than 1 + your skill modifier). Additionally, you cannot roll below an 11 for each of these 3 skills.</li></ul>"
                        ]
                    },
                    {
                        "Name": "Pack Tactics",
                        "Description": [
                            "At the eleventh level, your coordinate with your animal companion has increased tenfold. When you are attacking the same creature, you both gain advantage on your attacks."
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Druid",
                "Skill Modifier Bonuses": "You gain a +2 modifier to the following skills: <b>Nature</b>, <b>Stealth</b>, <b>Survival</b>. You additionally gain a +1 modifier to 3 of the following skills: <b>Animal Handling</b>, <b>Arcana</b>, <b>Investigation</b>, <b>Medicine</b>, <b>Mental Fortitude</b>, <b>Perception</b>, <b>Reflex</b>.",
                "Tool Modifier Bonuses": "You gain a +2 modifier to 2 of the following tools: <b>Climber’s Kit</b>, <b>Cook’s Utensils</b>, <b>Fishing Equipment</b>, <b>Healer’s Kit</b>, <b>Herbalism Kit</b>, <b>Tinker’s Tools</b>",
                "Weapon Modifier Bonuses": "You gain a +1 modifier to one of the following weapon groups: <b>Ambush Weapons</b>, <b>Bows and Slings</b>",
                "Spellcasting Modifier Bonuses": "You gain a +2 modifier increase to two schools of magic of your choice, and an additional +1 modifier to 2 other schools of magic.",
                "Armor Training": "You are trained in <b>Light</b> armor.",
                "Shield Training": "You are not trained in <b>Shields</b>.",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment.",
                "Primary Spellcasting Skill": "<b>Nature</b>",
                "Number of Spells Known": [
                    "At the first level, you know 4 + your <b>Nature</b> modifier spells.",
                    "Upon a level up, you learn 1 spell. Whenever your <b>Nature</b> modifier increases, you learn an additional spell."
                ],
                "Features": [
                    {
                        "Name": "Druidcraft",
                        "Description": [
                            "A basic spell all Druids learn, you create one of the following effects within 30 feet:<ul><li>You create a tiny, harmless sensory effect that predicts what the weather will be at your location for the next 24 hours. The effect might manifest as a golden orb for clear skies, a cloud for rain, falling snowflakes for snow, and so on. This effect persists for 1 round.</li><li>You instantly make a flower blossom, a seed pod open, or a leaf bud bloom.</li><li>You create an instantaneous, harmless sensory effect, such as falling leaves, a puff of wind, the sound of a small animal, or the faint odor of skunk. The effect must fit in a 5-foot cube.</li><You instantly light or snuff out a candle, a torch, or a small campfire.</li></ul>"
                        ]
                    },
                    {
                        "Name": "Wildshape",
                        "Description": [
                            "At the second level, you can use your action to magically assume the shape of a beast of up to CR 1/4 times your Druid level that you have encountered (minimum CR 1/2). You can use this ability a number of times equal to your Druid level per rest.",
                            "You can stay in a beast shape for a number of hours equal to half your Druid level (minimum 1). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using an ability action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.",
                            "While you are transformed, the following rules apply:<ul><li>Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and <b>Intelligence</b>, <b>Wisdom</b>, and <b>Charisma</b> based modifiers. If the creature has any legendary or lair actions, you can’t use them.</li><li>When you transform, you assume the beast’s hit points. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn’t reduce your normal form to 0 hit points, you aren’t knocked unconscious.</li><li>You can’t cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn’t break your concentration on a spell you’ve already cast, however, or prevent you from taking actions that are part of a spell, such as call lightning, that you’ve already cast.</li><li>You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can’t use any of your special senses, such as darkvision, unless your new form also has that sense.</li><li>You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the LM decides whether it is practical for the new form to wear a piece of equipment, based on the creature’s shape and size. Your equipment doesn’t change size or shape to match the new form, and any equipment that the new form can’t wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.</li></ul>"
                        ]
                    },
                    {
                        "Name": "Natural Recovery",
                        "Description": [
                            "At the third level, you gain the ability to heal using salves created from an Herbalism kit. Make a DC 20 Herbalism Kit Medicine check. Upon a success, you magically mutate the natural healing of a salve that you have already created that can be rubbed onto a creature healing 1d8 + your Nature modifier. It takes 1 hour to mutate this salve."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Wild Speak",
                        "Description": [
                            "At the sixth level, you gain one of the following benefits:"
                        ],
                        "Options": [
                            {
                                "Name": "Beast Speak",
                                "Description": [
                                    "You gain the ability to speak the language of each beast. The sounds of the words you say are magically trasmuted as you speak, sounding to all others as beastial sounds just like the creature you are attempting to speak to.",
                                    "Many beasts are not able to hold intelligible conversations, but rather speak in short quick bursts, as their concentration changes. While conversing with a beast, the creature is not charmed by you, and may even believe you a threat."
                                ]
                            },
                            {
                                "Name": "Plant Sense",
                                "Description": [
                                    "You gain the ability to magically sense the recent major events that have affected a plant you touch. The term major event is localized to what would be a major event for the plant, such as getting stepped on by some game, or getting heated from a firebolt wizzing nearby."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "Nature's Ward",
                        "Description": [
                            "When you reach seventh level, you cannot be charmed or frightened by creatures that resides in the wild, such as beasts or elementals, and you are immune to poison and disease. It is up to your LM to determine if a creature resides in the wild."
                        ]
                    },
                    {
                        "Name": "Beast Sense",
                        "Description": [
                            "At the eighth level, you gain the to see and hear through a willing beast. While perceiving through the beast’s senses, you gain the benefits of any special senses possessed by that creature, though you are blinded and deafened to your own surroundings."
                        ]
                    },
                    {
                        "Name": "Land's Stride",
                        "Description": [
                            "Starting at ninth level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.",
                            "In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such as those created by the entangle spell."
                        ]
                    },
                    {
                        "Name": "Beast Spells",
                        "Description": [
                            "Beginning at tenth level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren’t able to provide material components."
                        ]
                    },
                    {
                        "Name": "Nature's Sanctuary",
                        "Description": [
                            "When you reach 11th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make an <b>Insight Saving Throw</b> against your <b>Druid Spell Save DC</b>. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours.",
                            "The creature is aware of this effect before it makes its attack against you. This generally means that a beast will not attack you unless you threaten it."
                        ]
                    }
                ]
            }
        },
        {
            "Name": "War Priest",
            "Description": "For many, religion plays a prominent role in their lives. War Priests take this to the next level, devoting their lives to their god(s) and religion.",
            "Martial Archetype": {
                "Name": "Paladin",
                "Skill Modifier Bonuses": "You gain a +2 bonus to <b>Tradition</b> (of your religion). You additionally gain as +1 increase to the skill modifier of 3 of the following skills. You cannot choose any skill more than once. <b>Athletics</b>, <b>Constitution</b>, <b>Endurance</b>, <b>Insight</b>, <b>Intimidation</b>, <b>Medicine</b>, <b>Mental Fortitude</b>, <b>Persuasion</b>, <b>Perception</b>, <b>Reflex</b>.",
                "Tool Modifier Bonuses": "You gain a +2 bonus to <b>Healer’s Kit</b>.",
                "Weapon Modifier Bonuses": "You gain a +2 weapon bonus to any 3 weapon groups. You cannot choose the same weapon group more than once.",
                "Armor Training": "You are trained with <b>all</b> armor types",
                "Shield Training": "You are trained with <b>Shields</b>.",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment.",
                "Features": [
                    {
                        "Name": "Healing of the Faithful",
                        "Description": [
                            "At the first level, you remember your medic training. You always have bandages and other basic medical supplies with you. You have a pool of healing power that replenishes when you take a rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5.",
                            "As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.",
                            "Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Healing of the Faithful, expending hit points separately for each one.",
                            "This feature has no effect on undead and constructs."
                        ]
                    },
                    {
                        "Name": "Blessed Warrior",
                        "Description": [
                            "In the midst of combat, you feel like you get whispers from your god, directing you to the weak points on your opponent. Once per round, you can add an extra 1d4 to your attack roll. You can choose to use this ability after you have rolled, but before the LM informs you if you have hit."
                        ]
                    },
                    {
                        "Name": "Challenge of the Righteous",
                        "Description": [
                            "At the third level, your religious studies have taught you that in a challenge of the righteous and the sinful, the righteous will triumph. As an ability action, you issue a challenge that compels other creatures to do battle with you.",
                            "Pick one creature within sight. They must make a <b>Mental Fortitude Saving Throw</b> against your <b>Tradition</b> (of your religion) or <b>Intimidation</b> check. On a failed save, a creature can’t willingly move away from you. Additionally, if the creature chooses to attack, they have disadvantage attacking anyone except you.",
                            "You can only challenge one target a time - if you choose to challenge another creature while a second is currently under the effects of Challenge of the Righteous, all effects disappate. A creature can reroll the saving throw at the end of each of their turns.",
                            "When used outside of combat, on a failed save, the target will still suffer the above affects, but they will also attempt to initiate a duel.",
                            "This effect ends on the creature if you are incapacitated or die or if you lose sight of the creature."
                        ]
                    },
                    {
                        "Name": "Foresight of the Gods",
                        "Description": [
                            "At the fourth level, your connection with your god has grown stronger. When you take a rest, your dreams can take the form of powerful visions.",
                            "These visions are flashes of individual moments in the near future, and are usually focused on one specific person or object."
                        ],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Aura of Leadership",
                        "Description": [
                            "At the sixth level, your religious teachings have given you insight into how to lead better. Choose one from the following auras:"
                        ],
                        "Options": [
                            {
                                "Name": "Aura of Protection",
                                "Description": [
                                    "Whenever you and a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to half of your Paladin level. You must be conscious to grant this bonus."
                                ]
                            },
                            {
                                "Name": "Aura of Alacrity",
                                "Description": [
                                    "Your presence invigorates your companaions, allowing them to push their bodies to farther limits. Your walking speed increases by 10 feet. In addition, if you aren’t incapacitated, the walking speed of any ally who starts their turn within 5 feet of you increases by 10 feet until the end of that turn."
                                ]
                            },
                            {
                                "Name": "Aura of Courage",
                                "Description": [
                                    "You and friendly creatures within 10 feet of you can’t be frightened while you are conscious."
                                ]
                            },
                            {
                                "Name": "Aura of Hate",
                                "Description": [
                                    "You and friendly creatures gain advantage when making a melee attack against an opponent affected by Challenge of the Righteous. On a hit, you deal extra damage equal to half of your Paladin level.",
                                    "This burning hatred causes you and friendly creatures who use this ability to focus solely on the hated opponent, opening them up to strikes from other enemies. Attacks against you and friendly abilities using this ability gain advantage."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "Divine Health",
                        "Description": [
                            "At the seventh level, the martial connection to your god makes your immune to disease and poison (damage)."
                        ]
                    },
                    {
                        "Name": "Fruit of the Spirit",
                        "Description": [
                            "At the eighth level, you begin to heavily display one of the standard tenents your religions follow. Choose one of the following “fruits”; it should fit with the beliefs of your religion and god."
                        ],
                        "Options": [
                            {
                                "Name": "Dread",
                                "Description": [
                                    "Your religion states that all should fear your god. Once per rest, you are able to display this dread to your enemies.",
                                    "As shadows grow around you, make a <b>Performance</b> or <b>Tradition</b> (of your religion) check constested against a <b>Mental Fortitude Saving Throw</b> from each creature of your choice that you can see. On a failure, the creature becomes Frightened of you until they exit combat. They gain no extra chances to remove this condition while in combat."
                                ]
                            },
                            {
                                "Name": "Faithfulness",
                                "Description": [
                                    "Your religion holds that when you follow something, you should not waver in your beliefs. You gain advantage to <b>Mental Fortitude Checks</b>."
                                ]
                            },
                            {
                                "Name": "Joy",
                                "Description": [
                                    "Your religion believes that a person’s greatest happiness comes from their faith. You become immune to falling into despair or becoming Frightened. Allied creatures within 30 ft of you gain advantage to Saving Throws against becoming Frightened. Once per rest, you remember this joy, regaining hit points equal to twice your Paladin level.",
                                    "If this total takes you over your maximum hit points, any extra hit points become temporary hit points. Any temporary hit points gained from this ability that are not lost during combat will be lost upon taking a rest."
                                ]
                            },
                            {
                                "Name": "Self Sacrifice",
                                "Description": [
                                    "Your religion holds that a love of others is the most important attribute of someone. Once per round, when an allied creature is targeted from an attack, you can interpose yourself between the attacker and your ally. The attack roll is then made against your Armor Class, and if the attack hits, you take the damage. You must interpose before the LM states the attack roll.",
                                    "Additionally, you must have the movement range (subtracting movement already expended in this round of combat) to reach the point where you would interpose yourself. This ability does not count as a Reaction."
                                ]
                            },
                            {
                                "Name": "Suffering",
                                "Description": [
                                    "Your religion holds that people only grow from suffering. Even if the suffering is moments before death, your religious tenants state that a person can take the knowledged gained from the experience into their afterlife. As a follower of your religion, it is your duty to inflict that suffering. Your crit range increases by 1 - if you have no other modifiers to you crit range, it would be 19-20."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "Relentless Avenger",
                        "Description": [
                            "At the ninth level, you feel anger and pain when your allies are attacked. As a reaction when an ally is attacked, you can immediately make an opportunity attack against this foe. You do not need to be adjacent to this enemy already, but they need to be within your movement range (subtracting movement already expended in this round of combat). The speed and ferocity of any movement you take as part of this reaction is too fast for opponents to make opportunity attacks."
                        ]
                    },
                    {
                        "Name": "Second Aura of Leadership",
                        "Description": [
                            "At the tenth level, you are able to choose another aura presented in the fourth level ability <b>Aura of Leadership</b>. You cannot take an aura more than once."
                        ]
                    },
                    {
                        "Name": "Chamption of the Gods",
                        "Description": [
                            "At the eleventh level, your martial prowess and dedication to your religious order has caught the eye of your god. The range of all auras you have increases to 30 feet, regardless of the original range, and you gain resistance to all non-magical damage.",
                            "Your companions have also grabbed the attention of your god, as the Companions of the Champion. While they are within 30 feet of you, they gain advantage on both Death Saving Throws and Mental Fortitude Saving Throws."
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Cleric",
                "Skill Modifier Bonuses": "You gain a +2 bonus to <b>Tradition</b> (of your religion). You additionally gain as +1 increase to the skill modifier of 3 of the following skills. You cannot choose any skill more than once. <b>Insight</b>, <b>Intimidation</b>, <b>Medicine</b>, <b>Mental Fortitude</b>, <b>Persuasion</b>, <b>Perception</b>, <b>Reflex</b>.",
                "Tool Modifier Bonuses": "You gain a +2 bonus to <b>Healer’s Kit</b>.",
                "Weapon Modifier Bonuses": "You gain a +1 bonus to one weapon group of your choice.",
                "Spellcasting Modifier Bonuses": "You gain a +2 modifier increase to two Schools of Magic of your choice, and an additional +1 modifier to 2 other schools of magic.",
                "Armor Training": "You are trained with <b>Light</b> armor",
                "Shield Training": "You are not trained with <b>Shields</b>",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Primary Spellcasting Skill": "<b>Tradition</b> (of your religion)",
                "Number of Spells Known": [
                    "At the first level, you know 4 + your <b>Tradition</b> (of your religion) Modifier spells.",
                    "Upon a level up, you learn 1 spell. Whenever your <b>Tradition</b> (of your religion) Modifier increases, you learn an additional spell."
                ],
                "Features": [
                    {
                        "Name": "Thaumaturgy",
                        "Description": [
                            "At the first level, you can manifest a minor wonder, a sign of supernatural power, within 30 feet. You create one of the following magical effects within range:",
                            "<ul><li>Your voice booms up to three times as loud as normal for 1 minute.</li><li>You cause flames to flicker, brighten, dim, or change color for 1 minute.</li><li>You cause harmless tremors in the ground for 1 minute.</li><li>You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers.</li><li>You instantaneously cause an unlocked door or window to fly open or slam shut.</li><li>You alter the appearance of your eyes for 1 minute.</li></ul>",
                            "If you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time, and you can dismiss such an effect as an action."
                        ]
                    },
                    {
                        "Name": "Disciple of Life",
                        "Description": [
                            "At the second level, your healing spells are more effective. Whenever you cast a spell to restore hit points to a creature, the creature regains additional hit points equal to 2 + your <b>Tradition</b> (of your religion) modifier"
                        ]
                    },
                    {
                        "Name": "Channel of Divinity",
                        "Description": [
                            "At the third level, you gain use of one of the Channel Divinities presented below; it should fit with the beliefs of your religion and god. You can use your Channel Divinity a number of times equal to half your Cleric level per rest."
                        ],
                        "Options": [
                            {
                                "Name": "Balm of Peace",
                                "Description": [
                                    "You can use your Channel Divinity to make your very presence a soothing balm. As an action, you can move up to your speed, without provoking opportunity attacks, and when you move within 5 feet of any other creature during this action, you can restore a number of hit points to that creature equal to 2d6 + your <b>Tradition</b> (of your religion) modifier. A creature can receive this healing only once whenever you take this action."
                                ]
                            },
                            {
                                "Name": "Knowledge of the Ages",
                                "Description": [
                                    "You can use your Channel Divinity to tap into a divine well of knowledge. As an action, you choose one skill or tool. For 10 minutes, you add +10 to checks or saving throws with that skill or tool."
                                ]
                            },
                            {
                                "Name": "Path to the Grave",
                                "Description": [
                                    "You can use your Channel Divinity to mark another creature’s life force for termination.",
                                    "As an action, you choose one creature you can see within 30 feet of you, cursing it until the end of your next turn. The next time you or an ally of yours hits the cursed creature with an attack, the creature has vulnerability to all of that attack’s damage, and then the curse ends."
                                ]
                            },
                            {
                                "Name": "Preserve Life",
                                "Description": [
                                    "You can use your Channel Divinity to heal the badly injured.",
                                    "As an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your Cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can’t use this feature on an undead or a construct."
                                ]
                            },
                            {
                                "Name": "Touch of Death",
                                "Description": [
                                    "You can use Channel Divinity to destroy another creature’s life force by touch. When you creature with a melee attack, you can use Channel Divinity to deal extra necrotic damage to the target. The damage equals 5 + twice your Cleric level."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Second Channel Divinity",
                        "Description": [
                            "At the sixth level, you gain a second Channel Divinity as presented in the third level ability “Channel Divinity”. You cannot choose the same Channel Divinity more than once."
                        ]
                    },
                    {
                        "Name": "Divine Smite",
                        "Description": [
                            "At the seventh level, when you hit a creature with a weapon attack, you can expend 2 Mana to deal an extra 1d8 radiant damage to the target."
                        ]
                    },
                    {
                        "Name": "Channel Divinity: Aura of Healing",
                        "Description": [
                            "As an action, you can expend one of your Channel Divinity usages to heal yourself and all friendly creatures within 30 feet of you. All affected creatures regain hit points equal to your <b>Tradition</b> (of your religion) modifier. This healing is not affected by Disciple of Life."
                        ]
                    },
                    {
                        "Name": "Spellcasting Smite",
                        "Description": [
                            "At the ninth level, your Divine Smite extends to your spell attacks. When you cast a spell that deals damage, you can expend 2 Mana to deal an extra 1d8 radiant damage to the target."
                        ]
                    },
                    {
                        "Name": "Supreme Healing",
                        "Description": [
                            "Starting at tenth level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12."
                        ]
                    },
                    {
                        "Name": "Divine Intervention",
                        "Description": [
                            "At the eleventh level, you can call on your deity to intervene on your behalf when your need is great.",
                            "Imploring your deity’s aid requires you to use your action. Describe the assistance you seek. The LM chooses the nature of the intervention; the effect of any cleric spell or cleric feature would be appropriate. You can use this ability once per 7 days."
                        ]
                    }
                ]
            }
        }
    ]
}