{
    "entries": [
        {
            "Name": "Artisan",
            "Description": "All items need to have a creator. Artisans create, improve and repair objects, and have learned a number of skills to help them with this process.",
            "Martial Archetype": {
                "Name": "Craftsmen",
                "Skill Modifier Bonuses": "You gain a +1 increase to 3 of the following skills: <b>Athletics</b>, <b>Constitution</b>, <b>Endurance</b>, <b>Reflex</b>, <b>Investigation</b>, <b>Insight</b>, <b>Perception</b>, <b>Deception</b>, <b>Intimidation</b>, <b>Performance</b>.",
                "Tool Modifier Bonuses": "You gain a +3 modifier to one of the tool kits. You gain a +2 modifier to two other tool kits, and a +1 modifier to 3 others. You cannot choose the same tool kit to gain multiple modifiers from Craftsmen.",
                "Weapon Modifier Bonuses": "You gain a +2 modifier increase to <b>Hammers and Picks</b>, as well as another +2 modifier to another weapon group.",
                "Armor Training": "You are trained with <b>Light</b>, <b>Medium</b> and <b>Heavy</b> armor.",
                "Shield Training": "You are trained with <b>Shields</b>.",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Features": [
                    {
                        "Name": "Crafting",
                        "Description": [
                            "Starting at the 1st level, assuming you have access to the required tools and access to any needed environments, such as a forge, you are able to craft 5 gp * your Craftsmen level worth of a mundane object (that is not a +1 weapon or +1 armor) per day. If you finish crafting an object on a day but have spare gp left of your daily allotance, you can begin construction on another mundane item.",
                            "You do not need to specifically have the raw materials on hand. If you don’t have already, you just need the gold and a means to buy said materials.",
                            "For example, should a level 3 Craftsmen wish to make a War Spear, it would take 2 days of crafting - the first day to do 15 gp worth of construction, followed by 10 gp the next day."
                        ]
                    },
                    {
                        "Name": "Battle Smith",
                        "Description": [
                            "At the second level, your skills with crafting have made you very precise. When you take the attack action, you are able to directly target the your opponent’s armor in a direct attempt to damage it. If your weapon attack hits your target, you are able to forgo all damage your attack would do in favor of damaging the armor. A Damaged piece of armor has a -2 to the AC until it is repaired by <b>Leatherworker’s</b>, <b>Tinkers’</b> or <b>Smith’s Tools</b>.",
                            "The creature must be wearing armor for this ability to work. If the opponent is wearing <b>Padded</b>, <b>Leather</b> or any other armor with less than 2 AC bonus, their AC bonus from armor is reduced to 0."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Artisan of All Trades",
                        "Description": [
                            "At the fourth level, the basics of tool sets that come your way, allowing you to increase your proficiency with them more easily. You increase tool modifiers (not skills nor weapons) on a roll of natural 19 in addition to natural 20s."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Improved Crafting",
                        "Description": [
                            "At the sixth level, when you have access to a forge, you are able to craft mundane +1 weapons and armor. These items cost 2x their gp time price, but only their standard amount of gold of raw materials are needed to make them. In addition, a Craftsmen can turn a standard weapon or armor into its mundane +1 variant for no additional raw material, but half of the gold time.",
                            "For example, a level 6 Craftsmen wishing to craft a +1 War Spear from scratch would need to spend 2 days crafting - 30 gp of time spent on the first day, and another 20 on the second. However, only 25 gp of raw material would be needed to craft this spear (the character would only lose 25 gp of gold).",
                            "This same level 6 Craftsmen, if they should wish to turn a standard War Spear into a mundane +1 War Spear would only take 25 gp of crafting time on one day to complete the enhancements, with no extra raw material being needed."
                        ]
                    },
                    {
                        "Name": "Flash of Genius",
                        "Description": [
                            "Starting at seventh level, you gain the ability to come up with solutions under pressure. When you or another creature you can see within 30 feet of you makes an skill check, they your Craftsmen level to the roll.",
                            "You can use this feature a number of times equal to your Craftsmen level. You regain all expended uses when you finish a rest."
                        ]
                    },
                    {
                        "Name": "Improved Artisan of All Trades",
                        "Description": [
                            "At the eighth level, your knowledge of tools has become more refined. You increase tool modifiers (not skill nor weapon modifiers) on ar oll of a natural 18, 19 or 20."
                        ]
                    },
                    {
                        "Name": "Tool Expertise",
                        "Description": [
                            "At the ninth level, your skills with one tool become insurmountable. Choose one of the tool sets.",
                            "For the chosen tool, any roll below an 11 (before modifiers are appled) is treated as an 11 (before modifiers). Additionally, any passive checks that happen to use this tool become as if you rolled a natural 11, and are now calculated as 11 + your tool modifier + your skill modifier (if applicable) + other modifiers."
                        ]
                    },
                    {
                        "Name": "Improved Battle Smith",
                        "Description": [
                            "At the tenth level, when you attack a creature with damaged armor, in lieu dealing damage, you are able to expand upon the damage dealt. The armor become Shattered, giving it the creature a -5 AC bonus until repaired. This armor takes two repairs in order to be fixed - the first makes the armor Damaged (-2 AC bonus), and the second returns it to normal.",
                            "The creature must be wearing armor for this ability to work. If the opponent is wearing an armor with less than 5 AC bonus, their AC bonus from armor is reduced to 0."
                        ]
                    },
                    {
                        "Name": "Masterwork",
                        "Description": [
                            "At the eleventh level, you have finished your masterpiece. Confer with your LM to determine exactly what this item is - it could be a new or powerful weapon or armor (such as a gun, a “grenade” launcher using alchemical supplies, a +3 weapon or a +3 armor), a machine, or any other non-magical object in the world. With your LM’s permission, you could also invent a magical object with the help of a magic user.",
                            "Subtract whatever raw materials from your total gold equivalent to the gold cost of your item. You now have your masterpiece."
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Artificier",
                "Skill Modifier Bonuses": "You gain a +1 increase to 3 of the following skills: <b>Arcana</b>, <b>Reflex</b>, <b>Investigation</b>, <b>Insight</b>, <b>Perception</b>, <b>Deception</b>, <b>Intimidation</b>, <b>Performance</b>.",
                "Tool Modifier Bonuses": "You gain a +3 modifier to one of the tool kits. You gain a +2 modifier to two other tool kits, and a +1 modifier to 3 others. You cannot choose the same tool kit to gain multiple modifiers from Artificier.",
                "Weapon Modifier Bonuses": "You gain a +1 modifier increase to <b>Hammers and Picks</b>",
                "Spellcasting Modifier Bonuses": "You gain a +2 modifier increase to <b>Transmutation Magic</b>, and an additional +1 modifier to 2 other schools of magic",
                "Armor Training": "You are trained with <b>Light</b> and <b>Medium</b> armor.",
                "Shield Training": "You are trained with <b>Shields</b>.",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Primary Spellcasting Skill": "<b>Arcana</b>",
                "Number of Spells Known": [
                    "At the first level, you know 4 + your <b>Arcana</b> Modifier spells.",
                    "Upon a level up, you learn 1 spell. Whenever your <b>Arcana</b> Modifier increases, you learn an additional spell."
                ],
                "Features": [
                    {
                        "Name": "Magical Tinkering",
                        "Description": [
                            "At first level, you learn how to invest a spark of magic into mundane objects. To use this ability, you must have thieves’ tools or artisan’s tools in hand. You then touch a Tiny nonmagical object as an action and give it one of the following magical properties of your choice:",
                            "<ul><li>The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet.</li><li>Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. You utter the message when you bestow this property on the object, and the recording can be no more than 6 seconds long.</li><li>The object continuously emits your choice of an odor or a nonverbal sound (wind, waves, chirping, or the like). The chosen phenomenon is perceivable up to 10 feet away.</li><li>A static visual effect appears on one of the object’s surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements, as you like.</li></ul>",
                            "The chosen property lasts indefinitely. As an action, you can touch the object and end the property early.",
                            "You can bestow magic on multiple objects, touching one object each time you use this feature, though a single object can only bear one property at a time. The maximum number of objects you can affect with this feature at one time is equal to the number of levels in Artificier. If you try to exceed your maximum, the oldest property immediately ends, and then the new property applies."
                        ]
                    },
                    {
                        "Name": "Magic Item Crafting",
                        "Description": [
                            "Starting at the second level, you are able to imbue 5 gp * your Artificer level’s worth of magic into an object per day. If you finish crafting an object on a day but have spare gp left of your daily allotance, you can begin construction on another mundane item.",
                            "For every 5 gp you imbue into a magic item, you expend 1 mana.",
                            "In order to imbue an object, you need to have an mundane variant of it - you are not crafting the object from scratch, rather imbuing an object with magic. The total gold cost required to make a mundane object magical can be seen in the Equipment lists.",
                            "At the second level, you can only craft Common magic items. At the fourth, you can additionally craft Uncommon. At the sixth, Rare, the eighth, Very Rare, and at the tenth level, Legendary."
                        ]
                    },
                    {
                        "Name": "Minor Alchemy",
                        "Description": [
                            "Starting at third level when you select this school, you can temporarily alter the physical properties of one nonmagical object, changing it from one substance into another. You perform a special alchemical procedure on one object composed entirely of wood, stone (but not a gemstone), iron, copper, or silver, transforming it into a different one of those materials. For each 10 minutes you spend performing the procedure, you can transform up to 1 cubic foot of material. After 1 hour, or until you lose your concentration (as if you were concentrating on a spell), the material reverts to its original substance."
                        ]
                    },
                    {
                        "Name": "Runic Glyph",
                        "Description": [
                            "At the fourth level, you learn how to imbue items with spell. You cast a spell that targets either a single creature or an area and direct it into your chosen item. If the spell is a concentration spell, the concentration is held by the item, and will run until time runs out, or the object is destroyed.",
                            "You must pass a DC 20 + the level of the spell check of the spell’s school of magic in order to successfully imbue the object. On a success, as the spell is cast, the magic carves a rune specific to that spell into the object. When a creature that is not you gets within 5 feet of the glyph, the spell triggers.",
                            "If you fail the check, you expend mana as if you had just cast the spell.",
                            "The glyph is nearly invisible and requires a successful Investigation or Arcana check against your Arcana Spell Save DC to be found."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Scrivener",
                        "Description": [
                            "At the seventh level, your knowledge of magic allows you to create spell scrolls. In order to do so, you need to use Calligrapher’s Supplies and spend an hour writing the scroll and imbuing the scroll with magic. Make a Calligrapher’s Supplies Arcana check against a DC of 20 + the level of spell that you are attempting to apply to the scroll. Upon a success, your scroll has successfully been made. Upon a failure, the scrolls burns itself as if it had just been used.",
                            "Regardless of the outcome of your check, you expend mana as if you had just cast the spell."
                        ]
                    },
                    {
                        "Name": "The Right Tool for the Job",
                        "Description": [
                            "At eighth level, you learn how to produce exactly the tool you need: with thieves’ tools or artisan’s tools in hand, you can magically create one set of artisan’s tools in an unoccupied space within 5 feet of you. This creation requires 1 hour of uninterrupted work, which can coincide with a short or long rest. Though the product of magic, the tools are nonmagical, and they vanish when you use this feature again."
                        ]
                    },
                    {
                        "Name": "Spell-Storing Item",
                        "Description": [
                            "At ninth level, you learn how to store a spell in an object. You can touch a weapon or one item that you can use as a spellcasting focus, and you store a spell in it, choosing a 1st- or 2nd-level spell from the artificer spell list that requires 1 action to cast.",
                            "While holding the object, a creature can take an action to produce the spell’s effect from it, using your spellcasting ability modifier. If the spell requires concentration, the creature must concentrate. The spell stays in the object until it has been used or dispelled.",
                            "You can imbue a number of items in this manner equal to half of your Articier level. If you imbue one item more than this limit, the item with the oldest enchantment has the spell dispelled."
                        ]
                    },
                    {
                        "Name": "Improved Magic Item Crafting",
                        "Description": [
                            "At the tenth level, you can additionally add 5 * your Arcana spellcasting modifier worth of GP to the amount you can craft on a daily basis.",
                            "Additionally, your mana usage decreases from one mana per 5 gp used, to one mana per 10 gp used."
                        ]
                    },
                    {
                        "Name": "Soul of Artifice",
                        "Description": [
                            "At the eleventh level, you develop a mystical connection to magic items you have attuned to, which you can draw on for protection. When you are reduced to 0 hit points, but not killed outright, you can use your Reaction to end the attunement to one of your items, causing you to drop to 1 hit point instead of 0.",
                            "The magic imbuing the item you have lost attunement to takes the damage for you, and the item itself becomes mundane. In order to make the item magical again, it would need to go through the Magic Item Crafting process."
                        ]
                    }
                ]
            }
        },
        {
            "Name": "Actor",
            "Description": "Everyone needs happiness. An actor is a performer who not only entertains outsiders, but keeps up the spirits of their party with their personality and skills.",
            "Martial Archetype": {
                "Name": "Entertainer",
                "Skill Modifier Bonuses": "You gain a +2 increase to any 3 skill modifiers. You gain an additionaly +1 modifier to any 3 other skills. You cannot choose any skill more than once.",
                "Tool Modifier Bonuses": "You gain a +1 modifier increase to 3 of the following tool kits: <b>Alchemist’s Supplies</b>, <b>Brewer’s Supplies</b>, <b>Calligrapher’s Supplies</b>, <b>Carpenter’s Tools</b>, <b>Cartographer’s Tools</b>, <b>Disguise Kit</b>, <b>Leatherworker’s Tools</b>, <b>Mason’s Tools</b>, <b>Painter’s Supplies</b>, <b>Tinker’s Tools</b>, <b>Weaver’s Tools</b>, <b>Woodcarver’s Tools</b>.",
                "Weapon Modifier Bonuses": "You gain a +2 modifier increase to 2 of the following weapon groups: <b>Ambush Weapons</b>, <b>Bows and Slings</b>, <b>Combat Blades</b>, <b>Dueling Blades</b>, <b>Spears</b>, <b>Throwing Weapons</b>, <b>Natural Weapons</b>.",
                "Armor Training": "You are trained with <b>Light</b> and <b>Medium</b> armor.",
                "Shield Training": "You are trained with <b>Shields</b>.",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment.",
                "Features": [
                    {
                        "Name": "Inspiration",
                        "Description": [
                            "At the first level, you are able to inspire your allies with your theatrics. You have a number of Inspiration Die (d4) equal to your levels in Entertainer. Once per round, you are able to give this inspiration to your allies, allowing them to an extra d4 on any attack, skill check or saving throw.",
                            "You can give this inspiration after the role has been made, but before you know the outcome. The player must immediately use this Inspiration Die. You regain all spent Inspiration Die upon completion of a rest."
                        ]
                    },
                    {
                        "Name": "Entertainer’s Delight",
                        "Description": [
                            "Starting at the second level, during a rest, you are able to entertain your allies, allowing all (including yourself) to regain extra hit points equal to your number of levels in Entertainer."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Jack of All Trades",
                        "Description": [
                            "At the fourth level, as an entertainer, you tend to be good at just about anything that comes your way. If you aren’t good at it, you learn it. You increase skill modifiers (not tool nor weapon modifiers) on a roll of a natural 19, in addition to rolls of a natural 20."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Improved Inspiration",
                        "Description": [
                            "At the sixth level, your Inspiration Die given by your first level Inspiration ability are d6 rather than d4s.",
                            "Additionally, whoever gains your Inspiration Die no longer have to immediately spend them. They can be held and spent later in the day. A character can only hold one Inspiration Die - they can be given a second, but must immediately use it on the triggering roll."
                        ]
                    },
                    {
                        "Name": "Combat Inspiration",
                        "Description": [
                            "At the seventh level, when a player uses an Inspiration as part of an attack, the d6 rolled is applied to both the attack roll and the damage dealt."
                        ]
                    },
                    {
                        "Name": "Improved Entertainer’s Delight",
                        "Description": [
                            "At the eighth level, your entertainment during rests reaches new heights. Yourself and allies are cured of the Frightened condition if afflicted. Additionally, if any of the hit points gained from this ability would not be applied due to a character hitting their hit points maximum, the extra hit points become temporary hit points that are lost upon the next rest."
                        ]
                    },
                    {
                        "Name": "Expertise",
                        "Description": [
                            "At the ninth level, your skills with one ability become quite honed. Choose one of the following skills:",
                            "<b>Acrobatics</b>, <b>Tradition</b> (one specific tradition skill), <b>Insight</b>, <b>Deception</b>, <b>Intimidation</b>, <b>Performance</b>, <b>Persuasion</b>",
                            "For the chosen skills, any roll below a 11 (before modifiers are applied) is treated as a 11 (before modifiers). Additionally, your passive checks for this skill become as if you rolled a natural 11, and are now calculated as 11 + primary ability modifier + skill modifier + other modifiers"
                        ]
                    },
                    {
                        "Name": "Improved Jack of All Trades",
                        "Description": [
                            "At the tenth level, your way of learning has become more refined. You increase skill modifiers (not tool nor weapon modifiers) on a roll of a natural 18, 19 or 20.s"
                        ]
                    },
                    {
                        "Name": "Flourish",
                        "Description": [
                            "At the eleventh level, your skill with your weapon reflects your acting prowess. You are able to embed your own style into your fighting. Your movement speed increases by 10 ft. Once per turn, you can expend one of your Inspiration Die choose one of the following flourishes to embed as part of your action:"
                        ],
                        "Options": [
                            {
                                "Name": "Aggressive Flourish",
                                "Description": [
                                    "You gain a bonus to your weapon attack equal to your level in Entertainer for your next attack. If you score a critical hit, the target is stunned until the start of your next turn."
                                ]
                            },
                            {
                                "Name": "Defensive Flourish",
                                "Description": [
                                    "Your weapon gains the deflect trait (even if it is a ranged weapon). If your weapon already has the deflect trait, you can deflect an additional damage equal to your level in Entertainer.",
                                    "If you reduce the damage to 0 and your opponent is wielding a disarmable melee weapon, you disarm your opponent, and their blade falls into your hand (assuming you have a free hand). Otherwise, it falls to the ground."
                                ]
                            },
                            {
                                "Name": "Mobile Flourish",
                                "Description": [
                                    "You gain a spring in your step. You gain extra movement speed as if you had taken the dash action. For every 10 feet you move in a straight line before attacking an opponent this turn, you gain an extra 1d6 weapon damage."
                                ]
                            }
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Bard",
                "Skill Modifier Bonuses": "You gain a +2 increase <b>Performance to any other 2 skill modifiers. You gain an additionally +1 modifier to any 3 other skills. You cannot choose any skill more than once.",
                "Tool Modifier Bonuses": "You gain a +1 modifier increase to 3 of the following tool kits: <b>Alchemist’s Supplies</b>, <b>Brewer’s Supplies</b>, <b>Calligrapher’s Supplies</b>, <b>Carpenter’s Tools</b>, <b>Cartographer’s Tools</b>, <b>Disguise Kit</b>, <b>Leatherworker’s Tools</b>, <b>Mason’s Tools</b>, <b>Painter’s Supplies</b>, <b>Tinker’s Tools</b>, <b>Weaver’s Tools</b>, <b>Woodcarver’s Tools</b>.",
                "Weapon Modifier Bonuses": "You gain a +1 modifier increase to 1 of the following weapon groups: <b>Ambush Weapons</b>, <b>Bows and Slings</b>, <b>Combat Blades</b>, <b>Dueling Blades</b>, <b>Spears</b>, <b>Throwing Weapons</b>, <b>Natural Weapons</b>",
                "Spellcasting Modifier Bonuses": "You gain a +2 modifier increase to <b>Abjuration Magic</b>, and an additional +1 modifier to 2 other schools of magic.",
                "Armor Training": "You are trained with <b>Light</b> Armor",
                "Shield Training": "You are not trained with <b>Shields</b>",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Primary Spellcasting Skill": "<b>Performance</b>",
                "Number of Spells Known": [
                    "At the first level, you know 4 + your <b>Performance Modifier</b> spells.",
                    "Upon a level up, you learn 1 spell. Whenever your <b>Performance</b> Modifier increases, you learn an additional spell."
                ],
                "Features": [
                    {
                        "Name": "Magical Performance",
                        "Description": [
                            "At the first level, you are able to refresh your allies with your magical music. A number of times equal to your Bard level, you can perform a one minute tune, and all allies (yourself included) that can hear you gain temporary hitpoints equal to your Performance modifier."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Unsettling Words",
                        "Description": [
                            "At the third level, you can spin music laced with magic that unsettle a creature and cause it to doubt itself. As an Ability Action, you can expend one use of your Magical Performance and choose one creature you can see within 60 feet of you. Roll the Magical Performance die. The creature must subtract the number rolled from the next Saving Throw it makes before the start of your next turn."
                        ]
                    },
                    {
                        "Name": "Combat Performance",
                        "Description": [
                            "At the fourth level, as an action, you can make a Magical Performance. All allies that can hear you gain temporary hitpoints equal to one fourth (minimum 1) as a normal Magical Performance."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Improved Magical Performance",
                        "Description": [
                            "At the sixth level, your standard Magical Performance allows allies that can hear you to gain additional temporary hitpoints equal to your Bard level."
                        ]
                    },
                    {
                        "Name": "Second School of Magic Specialization",
                        "Description": [
                            "At the seventh level, you gain access to a second of magical specialization as defined by the level 2 Magic archetype ability. You cannot choose the same specialization more than once."
                        ]
                    },
                    {
                        "Name": "Countercharm",
                        "Description": [
                            "At eighth level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. Counting as 2 usages of your Magical Performance, you can start a performance that lasts until the end of your next turn.",
                            "During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required)."
                        ]
                    },
                    {
                        "Name": "Enhanced School of Magic Specialization",
                        "Description": [
                            "At the ninth level, your knowledge of your chosen school of magic increases. You have gained new abilities related to the school of magic specialization chosen at the second level."
                        ],
                        "Options": [
                            {
                                "Name": "Abjuration",
                                "Description": [
                                    "Your studies into Abjuration magic allows you to redirect some of the magic into the spell back to yourself. Once per rest, when you cast an Abjuration spell, you can pull a strand of the magic and surround yourself with it, giving you temporary hit points equal to your Abjuration spell modifier.",
                                    "Additionally, your bonus to your Abjuration Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Conjuration",
                                "Description": [
                                    "Your studies into Conjuration magic allow you to better teleport. Once per rest, you can teleport up to 30 feet to an unoccupied space you can see.",
                                    "Additionally, your bonus to your Conjuration Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Divination",
                                "Description": [
                                    "Your ability to see beyond begins to manifest physically. You gain Darkvision with a range of 60 feet. If you already have Darkvision, the range expands by 60 feet.",
                                    "Additionally, your bonus to your Divination Spell Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Enchantment",
                                "Description": [
                                    "Your knowledge of Enchantment magic allows you to subtlely shift the direction it flows. Once per rest when you cast an Enchantment spell that targets one creature, you can make the spell target 2 creatures.",
                                    "Additionally, your bonus to your Enchantment Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Evocation",
                                "Description": [
                                    "Your experience with Evocation magic allows you to sculpt Evocation spells you cast. Once per rest, when you cast an area of effect Evocation spell, you can make a number of pockets up to or equal to your Evocation Spellcasting Modifier within the spell’s range that are not affected by the spells effects.",
                                    "Additionally, your bonus to your Evocation Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Illusion",
                                "Description": [
                                    "Your studies into Illusion magic make it your go-to solution. Once per rest when you are attacked, you can use your reaction to create an illusion of yourself just in front of yourself. The attacker will automatically hit this illusion, which dispels it.",
                                    "Additionally, your bonus to your Illusion Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Malediction",
                                "Description": [
                                    "Your understanding of Malediction magic allows you to kick your enemies while they’re down. When you attack a creature affected by one of your Malediction spells, you deal extra damage equal to your Malediction Spellcasting Modifier.",
                                    "Additionally, your bonus to your Malediction Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Necromancy",
                                "Description": [
                                    "Your studies into Necromancy magic have given you a better understanding of life forces and how to manipulate them to your benefit. Once per rest, when you kill a creature that is not an undead or a construct with a Necromancy spell, you regain hitpoints equal to your Necromancy Spellcasting Modifier (up to your hit points maximum).",
                                    "Additionally, your bonus to your Necromancy Spellcasting Modifier increases to +2."
                                ]
                            },
                            {
                                "Name": "Transmutation",
                                "Description": [
                                    "Your studies into Transmutation magic have given you a better understanding of how magic flows. Once per rest, when you cast a Transmutation spell, you regain Mana equal to half of your Transmutation Spellcasting Bonus.",
                                    "Additionally, your bonus to your Transmutation Spellcasting Modifier increases to +2."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "Enthralling Performance",
                        "Description": [
                            "At the tenth level, once per rest, if you perform for at least 1 minute, you can attempt to inspire wonder in your audience by singing, reciting a poem, or dancing. At the end of the performance, choose a number of humanoids within 60 feet of you who watched and listened to all of it, up to a number equal to your Performance modifier. Each target must succeed on a Mental Fortitude Saving Throw against your spell save DC or be charmed by you.",
                            "While charmed in this way, the target idolizes you, it speaks glowingly of you to anyone who talks to it, and it hinders anyone who opposes you, although it avoids violence unless it was already inclined to fight on your behalf. This effect ends on a target after 1 hour, if it takes any damage, if you attack it, or if it witnesses you attacking or damaging any of its allies.",
                            "If a target succeeds on its saving throw, the target has no hint that you tried to charm it.",
                            "Using this ability counts as a usage of your Magical Performance."
                        ]
                    },
                    {
                        "Name": "Magical Secrets",
                        "Description": [
                            "At the eleventh level, your broad knowledge of magic allows you learn magic unlike others you have known. You learn 2 new spells, regardless of their level or if they are available for Bards normally."
                        ]
                    }
                ]
            }
        },
        {
            "Name": "Natural",
            "Description": "Not everyone receives formal training - some are naturally gifted. Naturals are characters that have received no formal training, but still excel at being an adventurer.",
            "Martial Archetype": {
                "Name": "Barbarian",
                "Skill Modifier Bonuses": "You gain a +1 increase to the skill modifier of 3 of the following skills. You cannot choose any skill more than once. <b>Athletics</b>, <b>Constitution</b>, <b>Endurance</b>, <b>Intimidation</b>, <b>Mental Fortitude</b>, <b>Perception</b>, <b>Reflex</b>, <b>Survival</b>",
                "Tool Modifier Bonuses": "None",
                "Weapon Modifier Bonuses": "You gain a +2 weapon bonus to 3 of the following weapon groups: <b>Axes</b>, <b>Bludgeons</b>, <b>Combat Blades</b>, <b>Dueling Blades</b>, <b>Flails and Whips</b>, <b>Hammers and Picks</b>, <b>Polearms</b>, <b>Spears</b>, <b>Throwing Weapons</b>, <b>Natural Weapons</b>",
                "Armor Training": "You are trained with <b>Light</b> and <b>Medium</b> armor",
                "Shield Training": "You are trained with <b>Shields</b>",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Features": [
                    {
                        "Name": "Battle Fury",
                        "Description": [
                            "In battle, you become deadly focused. At the first level, you can enter a battle fury as an ability action. For one minute, you have the following effects:",
                            "<ul><li>You have advantage on <b>Athletics</b>, <b>Constitution</b>, <b>Endurance</b> and <b>Mental Fortitude</b> checks and saving throws.</li>",
                            "<li>You gain a +2 damage bonus to all melee weapons (including Natural Weapons).</li>",
                            "<li>You gain resistance to all non-magical damage.</li>",
                            "<li>You gain temporary hitpoints equal to 3 * your number of levels in Barbarian. Any remaining temporary hit points are lost upon your battle fury ending.</li></ul>",
                            "You can enter a battle fury the number of levels you have in Barbarian per rest."
                        ]
                    },
                    {
                        "Name": "Endure",
                        "Description": [
                            "Your body has become accustomed to the strain and stress you subject it to. At the second level, when forced to make a <b>Reflex Saving Throw</b> to avoid damage, you can choose to make a <b>Constitution Saving Throw</b> instead."
                        ]
                    },
                    {
                        "Name": "Danger Sense",
                        "Description": [
                            "At the third level, you gain an uncanny sense when danger is nearby. You gain advantage when making Reflex saving throws against effects you can see or hear. You cannot use this ability if you are blinded and deafened."
                        ]
                    },
                    {
                        "Name": "Reckless Attack",
                        "Description": [
                            "Without formal training, you sieze every opportunity your opponent gives you to strike, regardless of the position it puts you in. At the fourth level, you gain advantage on all attack rolls until the start of your next turn, but all attacks against you also have advantage."
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Fast Movement",
                        "Description": [
                            "At the seventh level, your movement speed increases by 10 feet. You additionally gain a swim and climb speed equal to half of your movement speed (rounded down to the nearest multiple of 5) while in a battle fury."
                        ]
                    },
                    {
                        "Name": "Improved Danger Sense",
                        "Description": [
                            "At the eighth level, your Danger Sense has improved to the point that cannot be surprised. You gain advantage on all initiative rolls."
                        ]
                    },
                    {
                        "Name": "Brutal Critical",
                        "Description": [
                            "At the ninth level, when you score a critical hit, you automatically do maximum damage."
                        ]
                    },
                    {
                        "Name": "Indomitable",
                        "Description": [
                            "At the tenth level, once per rest, when you fail a Saving Throw, you can choose to succeed."
                        ]
                    },
                    {
                        "Name": "Relentless Focus",
                        "Description": [
                            "At the eleventh level, your Battle Fury can keep you fighting regardless of your wounds. If you drop to 0 hit points while in a Battle Fury, make a DC 10 Constitution Saving Throw. The DC increases by 5 after each success, and resets to DC 10 after a rest.",
                            "On a success, you can choose to remain conscious. However, you still take the damage as normal (this does mean you will likely have a negative hp). All damage you take until you fall unconscious will be applied when you fall unconscious - if your hit points become more negative than your maximum hit points, your character will immediately die."
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Sorcerer",
                "Skill Modifier Bonuses": "You gain a +2 increase to <b>Acrana</b>, and a +1 increase to two of the following skills. You cannot choose any skill more than once. <b>History</b>, <b>Mental Fortitude</b>, <b>Tradition</b> (of your Culture or Sorcerous Origin)",
                "Tool Modifier Bonuses": "None",
                "Weapon Modifier Bonuses": "You gain a +1 modifier increase to one weapon group of your choice.",
                "Spellcasting Modifier Bonuses": "You gain a +2 modifier increase to two schools of magic of your choice, and an additional +1 modifier to 2 other schools of magic",
                "Armor Training": "None",
                "Shield Training": "You are not trained with <b>Shields</b>.",
                "Starting Equipment": "5d4 * 10 gold to spend on your starting equipment",
                "Primary Spellcasting Skill": "<b>Arcana</b>",
                "Number of Spells Known": [
                    "At the first level, you know 4 + your <b>Arcana</b> Modifier spells.",
                    "Upon a level up, you learn 1 spell. Whenever your <b>Arcana</b> Modifier increases, you learn an additional spell."
                ],
                "Features": [
                    {
                        "Name": "Sorcerous Origin",
                        "Description": [
                            "At the first level, your magical bloodline presents itself. Choose from one of the following origins:"
                        ],
                        "Options": [
                            {
                                "Name": "Draconic",
                                "Description": [
                                    "Somewhere in your family history lies a dragon, or at least a blessing from a dragon. You can speak, read and write Draconic.",
                                    "Additionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren’t wearing armor, your skin provides a +1 armor bonus to your AC."
                                ]
                            },
                            
                            {
                                "Name": "Elemental",
                                "Description": [
                                    "Your bloodline has elemental influences within it. Choose one of the basic elements: Air, Earth, Fire or Water.\n\t<b>Air</b>You learn the Gust spell, and it does not count towards your known spells. Additionally, you can speak, read and write Auran.\n\t<b>Earth</b>You learn the Mold Earth spell, and it does not count towards your known spells. Additionally, you can speak, read and write Terran.\n\t<b>Fire</b>You learn the Control Flames spell, and it does not count towards your known spells. Additionally, you can speak, read and write Ignan.\n\t<b>Water</b>You learn the Shape Water spell, and it does not count towards your known spells. Additionally, you can speak, read and write Augan."
                                ]
                            },
                            {
                                "Name": "Shadow",
                                "Description": [
                                    "Something dark and magically powerful touched your bloodline. You always full the pull of this darkness, attempting to draw you closer to its worlds beyond the physical plane. You gain Darkvision to 120 feet. If you already have Darkvision, its range increases by 120 feet.",
                                    "Additionally, when rolling Death Saving Throws, a roll of 10 is counted as a success rather than a failure."
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "Wild Magic",
                        "Description": [
                            "Starting at the second level, your spellcasting can unleash surges of untamed magic. Immediately after you cast a spell where you rolled a 1 or a 20, a Wild Magic Surge occurs. A Wild Magic Surge can happen once per turn.",
                            "When a Wild Magic Surge happens, roll a d100, and refer to the table on the next page. If a spell is cast, it is never considered concentration - any concentration spell casted from Wild Magic ends its effects on the end of your next turn.",
                            "<table class=\"table table-striped table-hover\"><thead><tr><th>Roll</th><th>Effect</th></tr></thead><tbody><tr><td>1-2</td><td>A random spell from your list is cast, at a random location. If the spell targets a creature and there is no creature in the location, the spell automatically misses.</td></tr><tr><td>3-4</td><td>For the next minute, you can see any invisible creature if you have line of sight to it.</td></tr><tr><td>5-6</td><td>A modron chosen and controlled by the DM appears in an unoccupied space within 5 feet of you, then disappears 1 minute later.</td></tr><tr><td>7-8</td><td>The next time you take magical damage in the next minute, you take maximum damage</td></tr><tr><td>9-10</td><td>You cast magic missile</td></tr><tr><td>11-12</td><td>Roll a d10. Your height changes by a number of inches equal to the roll. If the roll is odd, you shrink. If the roll is even, you grow.</td></tr><tr><td>13-14</td><td>You cast confusion on yourself</td></tr><tr><td>15-16</td><td>For the next minute, you regain 5 hit points at the start of each of your turns.</td></tr><tr><td>17-18</td><td>You grow a long beard made of feathers that remains until you sneeze, at which point the feathers explode out from your face.</td></tr><tr><td>19-20</td><td>You cast grease on yourself</td></tr><tr><td>21-22</td><td>Creatures have disadvantage on saving throws against the next spell you cast in the next minute that involves a saving throw.</td></tr><tr><td>23-24</td><td>Your skin turns a vibrant shade of blue. A level 1 Remove Curse can end this effect.</td></tr><tr><td>25-26</td><td>An eye appears on your forehead for the next minute. During that time, you have advantage on Perception Checks that rely on sight.</td></tr><tr><td>27-28</td><td>For the next minute, all your spells with a casting time of 1 action have a casting time of 1 bonus action.</td></tr><tr><td>29-30</td><td>You teleport up to 60 feet to an unoccupied space of your choice that you can see.</td></tr><tr><td>31-32</td><td>You are transported to the Astral Plane until the end of your next turn, after which time you return to the space you previously occupied or the nearest unoccupied space if that space is occupied.</td></tr><tr><td>33-34</td><td>Maximize the damage of the next damaging spell you cast within the next minute.</td></tr><tr><td>35-36</td><td>Roll a d10. Your age changes by a number of years equal to the roll. If the roll is odd, you get younger (minimum 1 year old). If the roll is even, you get older.</td></tr><tr><td>37-38</td><td>1d6 flumphs controlled by the DM appear in unoccupied spaces within 60 feet of you and are frightened of you. They vanish after 1 minute.</td></tr><tr><td>39-40</td><td>You regain 2d10 hit points.</td></tr><tr><td>41-42</td><td>You turn into a potted plant until the start of your next turn. While a plant, you are incapacitated and have vulnerability to all damage. If you drop to 0 hit points, your pot breaks, and your form reverts.</td></tr><tr><td>43-44</td><td>For the next minute, you can teleport up to 20 feet as an Ability Action on each of your turns.</td></tr><tr><td>45-46</td><td>You cast levitate on yourself.</td></tr><tr><td>47-48</td><td>A unicorn controlled by the LM appears in a space within 5 feet of you, then disappears 1 minute later.</td></tr><tr><td>49-50</td><td>You can’t speak for the next minute. Whenever you try, pink bubbles float out of your mouth.</td></tr><tr><td>51-52</td><td>A spectral shield hovers near you for the next minute, granting you a +2 bonus to AC and immunity to magic missile.</td></tr><tr><td>53-54</td><td>You are immune to being intoxicated by alcohol for the next 5d6 days.</td></tr><tr><td>55-56</td><td>Your hair falls out but grows back within 24 hours.</td></tr><tr><td>57-58</td><td>For the next minute, any flammable object you touch that isn’t being worn or carried by another creature bursts into flame.</td></tr><tr><td>59-60</td><td>You regain 2 mana.</td></tr><tr><td>61-62</td><td>For the next minute, you must shout when you speak.</td></tr><tr><td>63-64</td><td>You cast fog cloud centered on yourself.</td></tr><tr><td>65-66</td><td>You lose 2 mana.</td></tr><tr><td>67-68</td><td>You are frightened by the nearest creature until the end of your next turn.</td></tr><tr><td>69-70</td><td>Each creature within 30 feet of you becomes invisible for the next minute. The invisibility ends on a creature when it attacks or casts a spell.</td></tr><tr><td>71-72</td><td>You gain resistance to all damage for the next minute.</td></tr><tr><td>73-74</td><td>You gain vulnerability to all damage for the next minute.</td></tr><tr><td>75-76</td><td>You glow with bright light in a 30-foot radius for the next minute. Any creature that ends its turn within 5 feet of you is blinded until the end of its next turn.</td></tr><tr><td>77-78</td><td>You cast polymorph on yourself. If you fail the saving throw, you turn into a sheep for the spell’s duration.</td></tr><tr><td>79-80</td><td>Illusory butterflies and flower petals flutter in the air within 10 feet of you for the next minute.</td></tr><tr><td>81-82</td><td>You can take one additional action immediately.</td></tr><tr><td>83-84</td><td>Each creature within 30 feet of you (including yourself) takes 1d10 necrotic damage.</td></tr><tr><td>85-86</td><td>You cast mirror image.</td></tr><tr><td>87-88</td><td>You cast fly on a random creature within 60 feet of you.</td></tr><tr><td>89-90</td><td>You become invisible for the next minute. During that time, other creatures can’t hear you. The invisibility ends if you attack or cast a spell.</td></tr><tr><td>91-92</td><td>You lose your action for next turn.</td></tr><tr><td>93-94</td><td>Your size increases by one size category for the next minute.</td></tr><tr><td>95-96</td><td>You lose all mana.</td></tr><tr><td>97-98</td><td>You are surrounded by faint, ethereal music for the next minute.</td></tr><tr><td>99-100</td><td>You regain all expended mana.</td></tr></tbody></table>"
                        ]
                    },
                    {
                        "Name": "Elemental Adept",
                        "Description": [
                            "At the third level, your start to focus on one type of spell damage. Choose a type of magical damage of your choice. When you deal this type of damage from a spell, you are able to add your Evocation Spellcasting Modifier to the damage of the spell. If you are already adding your Evocation Spellcasting Modifier to the damage of the spell, add the modifier again."
                        ]
                    },
                    {
                        "Name": "Metamagic",
                        "Description": [
                            "At the fourth level, you begin to manifest abilities related to spells that only a magical bloodline can perform. Choose two of the following options. When Metamagic is used. Roll a d20. On a roll of a 1, a Wild Magic Surge occurs."
                        ],
                        "Options": [
                            {
                                "Name": "Distant Spell",
                                "Description": [
                                    "When you cast a spell that has a range of 5 feet or greater, you can spend 1 spell point to double the range of the spell.",
                                    "When you cast a spell that has a range of touch, you can spend 1 spell point to make the range of the spell 30 feet."
                                ]
                            },
                            {
                                "Name": "Extended Spell",
                                "Description": [
                                    "When you cast a spell that has a duration of 1 minute or longer, you can spend 1 spell point to double its duration, to a maximum duration of 24 hours."
                                ]
                            },
                            {
                                "Name": "Heightened Spell",
                                "Description": [
                                    "When you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 mana to give one target of the spell disadvantage on its first saving throw made against the spell."
                                ]
                            },
                            {
                                "Name": "Quickened Spell",
                                "Description": [
                                    "When you cast a spell that has a casting time of 1 action, you can spend 2 mana to change the casting time to 1 ability action for this casting."
                                ]
                            },
                            {
                                "Name": "Seeking Spell",
                                "Description": [
                                    "If you make an attack roll for a spell and miss, you can spend 2 mana to reroll the d20, and you must use the new roll.",
                                    "You can use Seeking Spell even if you have already used a different Metamagic option during the casting of the spell."
                                ]
                            },
                            {
                                "Name": "Subtle Spell",
                                "Description": [
                                    "When you cast a spell, you can spend 1 spell point to cast it without any somatic or verbal components.",
                                    "To be eligible, a spell must be incapable of targeting more than one creature at the spell’s current level."
                                ]
                            },
                            {
                                "Name": "Twinned Spell",
                                "Description": [
                                    "When you cast a spell that targets only one creature and doesn’t have a range of self, you can spend a number of mana as determined in the below table to target a second creature in range with the same spell.\n<table class=\"table table-striped table-hover\"><thead><tr><td>Spell Level</td><td>Mana Cost</td></tr></thead><tbody><tr><td>1</td><td>1</td><tr><td>2</td><td>2</td><tr><td>3</td><td>3</td><tr><td>4</td><td>5</td><tr><td>5</td><td>8</td><tr><td>6</td><td>13</td></tr></tbody></table>"
                                ]
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "TODO",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    },
                    {
                        "Name": "Improved Elemental Adept",
                        "Description": [
                            "At the seventh level, your understanding of your chosen damage type increases. You gain resistance to that type of damage (both magical and nonmagical)."
                        ]
                    },
                    {
                        "Name": "Improved Metamagic",
                        "Description": [
                            "At the eighth level, you acquire two more metamagic options as presented in the level four ability. You cannot choose the same option twice."
                        ]
                    },
                    {
                        "Name": "Tides of Chaos",
                        "Description": [
                            "Starting at ninth level, you can manipulate the forces of chance and chaos to gain advantage on one attack roll, ability check, or saving throw. You can use this feature a number of times equal to your Sorcerer level per rest.",
                            "When you use this ability, roll a d20. Upon a roll of a 1, a Wild Magic Surge occurs."
                        ]
                    },
                    {
                        "Name": "Spell Bombardment",
                        "Description": [
                            "Beginning at tenth level, the harmful energy of your spells intensifies. When you roll damage for a spell and roll the highest number possible on any of the dice, choose one of those dice, roll it again and add that roll to the damage. You can use the feature only once per turn."
                        ]
                    },
                    {
                        "Name": "Master Elemental Adept",
                        "Description": [
                            "At the eleventh level, you become a master of your chosen element. You are able to ignore resistance for your chosen damage type, and creatures that are immune to the damage type are only resistant to your spells that deal this damage."
                        ]
                    }
                ]
            }
        },
        {
            "Name": "Name",
            "Description": "",
            "Martial Archetype": {
                "Name": "Name",
                "Skill Modifier Bonuses": "Bonuses",
                "Tool Modifier Bonuses": "Bonuses",
                "Weapon Modifier Bonuses": "Bonuses",
                "Armor Training": "Training",
                "Shield Training": "Training",
                "Starting Equipment": "Equipment",
                "Features": [
                    {
                        "Name": "Name",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Name",
                "Skill Modifier Bonuses": "Bonuses",
                "Tool Modifier Bonuses": "Bonuses",
                "Weapon Modifier Bonuses": "Bonuses",
                "Spellcasting Modifier Bonuses": "Bonuses",
                "Armor Training": "Training",
                "Shield Training": "Training",
                "Starting Equipment": "Equipment",
                "Primary Spellcasting Skill": "",
                "Number of Spells Known": [],
                "Features": [
                    {
                        "Name": "Name",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    }
                ]
            }
        },
        {
            "Name": "Name",
            "Description": "",
            "Martial Archetype": {
                "Name": "Name",
                "Skill Modifier Bonuses": "Bonuses",
                "Tool Modifier Bonuses": "Bonuses",
                "Weapon Modifier Bonuses": "Bonuses",
                "Armor Training": "Training",
                "Shield Training": "Training",
                "Starting Equipment": "Equipment",
                "Features": [
                    {
                        "Name": "Name",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Name",
                "Skill Modifier Bonuses": "Bonuses",
                "Tool Modifier Bonuses": "Bonuses",
                "Weapon Modifier Bonuses": "Bonuses",
                "Spellcasting Modifier Bonuses": "Bonuses",
                "Armor Training": "Training",
                "Shield Training": "Training",
                "Starting Equipment": "Equipment",
                "Primary Spellcasting Skill": "",
                "Number of Spells Known": [],
                "Features": [
                    {
                        "Name": "Name",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    }
                ]
            }
        },
        {
            "Name": "Name",
            "Description": "",
            "Martial Archetype": {
                "Name": "Name",
                "Skill Modifier Bonuses": "Bonuses",
                "Tool Modifier Bonuses": "Bonuses",
                "Weapon Modifier Bonuses": "Bonuses",
                "Armor Training": "Training",
                "Shield Training": "Training",
                "Starting Equipment": "Equipment",
                "Features": [
                    {
                        "Name": "Name",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Name",
                "Skill Modifier Bonuses": "Bonuses",
                "Tool Modifier Bonuses": "Bonuses",
                "Weapon Modifier Bonuses": "Bonuses",
                "Spellcasting Modifier Bonuses": "Bonuses",
                "Armor Training": "Training",
                "Shield Training": "Training",
                "Starting Equipment": "Equipment",
                "Primary Spellcasting Skill": "",
                "Number of Spells Known": [],
                "Features": [
                    {
                        "Name": "Name",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    }
                ]
            }
        },
        {
            "Name": "Name",
            "Description": "",
            "Martial Archetype": {
                "Name": "Name",
                "Skill Modifier Bonuses": "Bonuses",
                "Tool Modifier Bonuses": "Bonuses",
                "Weapon Modifier Bonuses": "Bonuses",
                "Armor Training": "Training",
                "Shield Training": "Training",
                "Starting Equipment": "Equipment",
                "Features": [
                    {
                        "Name": "Name",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    }
                ]
            },
            "Magic Archetype": {
                "Name": "Name",
                "Skill Modifier Bonuses": "Bonuses",
                "Tool Modifier Bonuses": "Bonuses",
                "Weapon Modifier Bonuses": "Bonuses",
                "Spellcasting Modifier Bonuses": "Bonuses",
                "Armor Training": "Training",
                "Shield Training": "Training",
                "Starting Equipment": "Equipment",
                "Primary Spellcasting Skill": "",
                "Number of Spells Known": [],
                "Features": [
                    {
                        "Name": "Name",
                        "Description": [],
                        "Options": [
                            {
                                "Name": "Name",
                                "Description": []
                            }
                        ]
                    }
                ]
            }
        }
    ]
}